hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_esc_regs.h
/* Bitfield definition for register: BUILD */
/*
 * BUILD (RO)
 *
 */
#define ESC_BUILD_BUILD_MASK (0xFF00U)
#define ESC_BUILD_BUILD_SHIFT (8U)
#define ESC_BUILD_BUILD_GET(x) (((uint16_t)(x) & ESC_BUILD_BUILD_MASK) >> ESC_BUILD_BUILD_SHIFT)

/*
 * Y (RO)
 *
 * minor version Y
 */
#define ESC_BUILD_Y_MASK (0xF0U)
#define ESC_BUILD_Y_SHIFT (4U)
#define ESC_BUILD_Y_GET(x) (((uint16_t)(x) & ESC_BUILD_Y_MASK) >> ESC_BUILD_Y_SHIFT)

/*
 * Z (RO)
 *
 * maintenance version Z
 */
#define ESC_BUILD_Z_MASK (0xFU)
#define ESC_BUILD_Z_SHIFT (0U)
#define ESC_BUILD_Z_GET(x) (((uint16_t)(x) & ESC_BUILD_Z_MASK) >> ESC_BUILD_Z_SHIFT)

/* Bitfield definition for register: FMMU_NUM */
/*
 * NUM (RO)
 *
 * Number of supported FMMU channels (or entities)
 */
#define ESC_FMMU_NUM_NUM_MASK (0xFFU)
#define ESC_FMMU_NUM_NUM_SHIFT (0U)
#define ESC_FMMU_NUM_NUM_GET(x) (((uint8_t)(x) & ESC_FMMU_NUM_NUM_MASK) >> ESC_FMMU_NUM_NUM_SHIFT)

/* Bitfield definition for register: SYNCM_NUM */
/*
 * NUM (RO)
 *
 * Number of supported SyncManager channels (or entities)
 */
#define ESC_SYNCM_NUM_NUM_MASK (0xFFU)
#define ESC_SYNCM_NUM_NUM_SHIFT (0U)
#define ESC_SYNCM_NUM_NUM_GET(x) (((uint8_t)(x) & ESC_SYNCM_NUM_NUM_MASK) >> ESC_SYNCM_NUM_NUM_SHIFT)

/* Bitfield definition for register: RAM_SIZE */
/*
 * SIZE (RO)
 *
 * Process Data RAM size supported in KByte
 */
#define ESC_RAM_SIZE_SIZE_MASK (0xFFU)
#define ESC_RAM_SIZE_SIZE_SHIFT (0U)
#define ESC_RAM_SIZE_SIZE_GET(x) (((uint8_t)(x) & ESC_RAM_SIZE_SIZE_MASK) >> ESC_RAM_SIZE_SIZE_SHIFT)

/* Bitfield definition for register: PORT_DESC */
/*
 * PORT3 (RO)
 *
 * Port configuration:
 * 00:Not implemented
 * 01:Not configured (SII EEPROM)
 * 10:EBUS
 * 11:MII/RMII/RGMII
 */
#define ESC_PORT_DESC_PORT3_MASK (0xC0U)
#define ESC_PORT_DESC_PORT3_SHIFT (6U)
#define ESC_PORT_DESC_PORT3_GET(x) (((uint8_t)(x) & ESC_PORT_DESC_PORT3_MASK) >> ESC_PORT_DESC_PORT3_SHIFT)

/*
 * PORT2 (RO)
 *
 * Port configuration:
 * 00:Not implemented
 * 01:Not configured (SII EEPROM)
 * 10:EBUS
 * 11:MII/RMII/RGMII
 */
#define ESC_PORT_DESC_PORT2_MASK (0x30U)
#define ESC_PORT_DESC_PORT2_SHIFT (4U)
#define ESC_PORT_DESC_PORT2_GET(x) (((uint8_t)(x) & ESC_PORT_DESC_PORT2_MASK) >> ESC_PORT_DESC_PORT2_SHIFT)

/*
 * PORT1 (RO)
 *
 * Port configuration:
 * 00:Not implemented
 * 01:Not configured (SII EEPROM)
 * 10:EBUS
 * 11:MII/RMII/RGMII
 */
#define ESC_PORT_DESC_PORT1_MASK (0xCU)
#define ESC_PORT_DESC_PORT1_SHIFT (2U)
#define ESC_PORT_DESC_PORT1_GET(x) (((uint8_t)(x) & ESC_PORT_DESC_PORT1_MASK) >> ESC_PORT_DESC_PORT1_SHIFT)

/*
 * PORT0 (RO)
 *
 * Port configuration:
 * 00:Not implemented
 * 01:Not configured (SII EEPROM)
 * 10:EBUS
 * 11:MII/RMII/RGMII
 */
#define ESC_PORT_DESC_PORT0_MASK (0x3U)
#define ESC_PORT_DESC_PORT0_SHIFT (0U)
#define ESC_PORT_DESC_PORT0_GET(x) (((uint8_t)(x) & ESC_PORT_DESC_PORT0_MASK) >> ESC_PORT_DESC_PORT0_SHIFT)

/* Bitfield definition for register: FEATURE */
/*
 * FFSC (RO)
 *
 * Fixed FMMU/SyncManager configuration:
 * 0:Variable configuration
 * 1:Fixed configuration (refer to documentation of supporting ESCs)
 */
#define ESC_FEATURE_FFSC_MASK (0x800U)
#define ESC_FEATURE_FFSC_SHIFT (11U)
#define ESC_FEATURE_FFSC_GET(x) (((uint16_t)(x) & ESC_FEATURE_FFSC_MASK) >> ESC_FEATURE_FFSC_SHIFT)

/*
 * RWC (RO)
 *
 * EtherCAT read/write command support(BRW,APRW,FPRW):
 * 0:Supported
 * 1:Not supported
 */
#define ESC_FEATURE_RWC_MASK (0x400U)
#define ESC_FEATURE_RWC_SHIFT (10U)
#define ESC_FEATURE_RWC_GET(x) (((uint16_t)(x) & ESC_FEATURE_RWC_MASK) >> ESC_FEATURE_RWC_SHIFT)

/*
 * LRW (RO)
 *
 * EtherCAT LRW command support:
 * 0:Supported
 * 1:Not supported
 */
#define ESC_FEATURE_LRW_MASK (0x200U)
#define ESC_FEATURE_LRW_SHIFT (9U)
#define ESC_FEATURE_LRW_GET(x) (((uint16_t)(x) & ESC_FEATURE_LRW_MASK) >> ESC_FEATURE_LRW_SHIFT)

/*
 * EDSA (RO)
 *
 * Enhanced DC SYNC Activation:
 * 0:Not available
 * 1:Available
 * Note:This feature refers to registers 0x981[7:3] and 0x0984
 */
#define ESC_FEATURE_EDSA_MASK (0x100U)
#define ESC_FEATURE_EDSA_SHIFT (8U)
#define ESC_FEATURE_EDSA_GET(x) (((uint16_t)(x) & ESC_FEATURE_EDSA_MASK) >> ESC_FEATURE_EDSA_SHIFT)

/*
 * SHFE (RO)
 *
 * Seperate Handling of FCS Errors:
 * 0:Not supported
 * 1:Supported, frames with wrong FCS and additional nibble will be counted separately in Forwarded RX Error Counter
 */
#define ESC_FEATURE_SHFE_MASK (0x80U)
#define ESC_FEATURE_SHFE_SHIFT (7U)
#define ESC_FEATURE_SHFE_GET(x) (((uint16_t)(x) & ESC_FEATURE_SHFE_MASK) >> ESC_FEATURE_SHFE_SHIFT)

/*
 * ELDM (RO)
 *
 * Enhanced Link Detection MII:
 * 0:Not available
 * 1:Available
 */
#define ESC_FEATURE_ELDM_MASK (0x40U)
#define ESC_FEATURE_ELDM_SHIFT (6U)
#define ESC_FEATURE_ELDM_GET(x) (((uint16_t)(x) & ESC_FEATURE_ELDM_MASK) >> ESC_FEATURE_ELDM_SHIFT)

/*
 * DCW (RO)
 *
 * Distributed Clocks width:
 * 0:32 bit
 * 1:64 bit
 */
#define ESC_FEATURE_DCW_MASK (0x8U)
#define ESC_FEATURE_DCW_SHIFT (3U)
#define ESC_FEATURE_DCW_GET(x) (((uint16_t)(x) & ESC_FEATURE_DCW_MASK) >> ESC_FEATURE_DCW_SHIFT)

/*
 * DC (RO)
 *
 * Distributed Clocks:
 * 0:Not available
 * 1:Available
 */
#define ESC_FEATURE_DC_MASK (0x4U)
#define ESC_FEATURE_DC_SHIFT (2U)
#define ESC_FEATURE_DC_GET(x) (((uint16_t)(x) & ESC_FEATURE_DC_MASK) >> ESC_FEATURE_DC_SHIFT)

/*
 * FMMU (RO)
 *
 * FMMU Operation:
 * 0:Bit oriented
 * 1:Byte oriented
 */
#define ESC_FEATURE_FMMU_MASK (0x1U)
#define ESC_FEATURE_FMMU_SHIFT (0U)
#define ESC_FEATURE_FMMU_GET(x) (((uint16_t)(x) & ESC_FEATURE_FMMU_MASK) >> ESC_FEATURE_FMMU_SHIFT)

/* Bitfield definition for register: STATION_ADDR */
/*
 * ADDR (RO)
 *
 * Address used for node addressing
 * (FPRD/FPWR/FPRW/FRMW commands)
 */
#define ESC_STATION_ADDR_ADDR_MASK (0xFFFFU)
#define ESC_STATION_ADDR_ADDR_SHIFT (0U)
#define ESC_STATION_ADDR_ADDR_GET(x) (((uint16_t)(x) & ESC_STATION_ADDR_ADDR_MASK) >> ESC_STATION_ADDR_ADDR_SHIFT)

/* Bitfield definition for register: STATION_ALS */
/*
 * ADDR (RW)
 *
 * Alias Address used for node addressing
 * (FPRD/FPWR/FPRW/FRMW commands).
 * The use of this alias is activated by Register
 * DL Control Bit 0x0100[24].
 * NOTE:EEPROM value is only transferred into this
 * register at first EEPROM load after power-on or
 * reset.
 * ESC20 exception:EEPROM value is transferred
 * into this register after each EEPROM reload
 * command.
 */
#define ESC_STATION_ALS_ADDR_MASK (0xFFFFU)
#define ESC_STATION_ALS_ADDR_SHIFT (0U)
#define ESC_STATION_ALS_ADDR_SET(x) (((uint16_t)(x) << ESC_STATION_ALS_ADDR_SHIFT) & ESC_STATION_ALS_ADDR_MASK)
#define ESC_STATION_ALS_ADDR_GET(x) (((uint16_t)(x) & ESC_STATION_ALS_ADDR_MASK) >> ESC_STATION_ALS_ADDR_SHIFT)

