hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_esc_regs.h
/* Bitfield definition for register: REG_WEN */
/*
 * EN (RO)
 *
 * If register write protection is enabled, this
 * register has to be written in the same
 * Ethernet frame (value does not matter)
 * before other writes to this station are allowed.
 * This bit is self-clearing at the beginning of the
 * next frame (SOF), or if Register Write
 * Protection is disabled.
 */
#define ESC_REG_WEN_EN_MASK (0x1U)
#define ESC_REG_WEN_EN_SHIFT (0U)
#define ESC_REG_WEN_EN_GET(x) (((uint8_t)(x) & ESC_REG_WEN_EN_MASK) >> ESC_REG_WEN_EN_SHIFT)

/* Bitfield definition for register: REG_WP */
/*
 * WP (RO)
 *
 * Register write protection:
 * 0:Protection disabled
 * 1:Protection enabled
 * Registers 0x0000:0x0F7F are write-protected,
 * except for 0x0020 and 0x0030
 */
#define ESC_REG_WP_WP_MASK (0x1U)
#define ESC_REG_WP_WP_SHIFT (0U)
#define ESC_REG_WP_WP_GET(x) (((uint8_t)(x) & ESC_REG_WP_WP_MASK) >> ESC_REG_WP_WP_SHIFT)

/* Bitfield definition for register: ESC_WEN */
/*
 * EN (RO)
 *
 * If ESC write protection is enabled, this
 * register has to be written in the same
 * Ethernet frame (value does not matter)
 * before other writes to this station are allowed.
 * This bit is self-clearing at the beginning of the
 * next frame (SOF), or if ESC Write Protection
 * is disabled.
 */
#define ESC_ESC_WEN_EN_MASK (0x1U)
#define ESC_ESC_WEN_EN_SHIFT (0U)
#define ESC_ESC_WEN_EN_GET(x) (((uint8_t)(x) & ESC_ESC_WEN_EN_MASK) >> ESC_ESC_WEN_EN_SHIFT)

/* Bitfield definition for register: ESC_WP */
/*
 * WP (RO)
 *
 * Write protect:
 * 0:Protection disabled
 * 1:Protection enabled
 * All areas are write-protected, except for 0x0030.
 */
#define ESC_ESC_WP_WP_MASK (0x1U)
#define ESC_ESC_WP_WP_SHIFT (0U)
#define ESC_ESC_WP_WP_GET(x) (((uint8_t)(x) & ESC_ESC_WP_WP_MASK) >> ESC_ESC_WP_WP_SHIFT)

/* Bitfield definition for register: ESC_RST_ECAT */
/*
 * PR (RO)
 *
 * Progress of the reset procedure:
 * 00:initial/reset state
 * 01:after writing 0x52 ('R'), when previous
 * state was 00
 * 10:after writing 0x45 ('E'), when previous
 * state was 01
 * 11:after writing 0x53 ('S'), when previous
 * state was 10.
 * This value must not be observed
 * because the ESC enters reset when this
 * state is reached, resulting in state 00
 */
#define ESC_ESC_RST_ECAT_PR_MASK (0x3U)
#define ESC_ESC_RST_ECAT_PR_SHIFT (0U)
#define ESC_ESC_RST_ECAT_PR_GET(x) (((uint8_t)(x) & ESC_ESC_RST_ECAT_PR_MASK) >> ESC_ESC_RST_ECAT_PR_SHIFT)

/* Bitfield definition for register: ESC_RST_PDI */
/*
 * RST (RW)
 *
 * A reset is asserted after writing the reset
 * sequence 0x52 ('R'), 0x45 ('E') and 0x53 ('S')
 * in this register with 3 consecutive commands.
 * Any other command which does not continue
 * the sequence by writing the next expected
 * value will cancel the reset procedure
 */
#define ESC_ESC_RST_PDI_RST_MASK (0xFFU)
#define ESC_ESC_RST_PDI_RST_SHIFT (0U)
#define ESC_ESC_RST_PDI_RST_SET(x) (((uint8_t)(x) << ESC_ESC_RST_PDI_RST_SHIFT) & ESC_ESC_RST_PDI_RST_MASK)
#define ESC_ESC_RST_PDI_RST_GET(x) (((uint8_t)(x) & ESC_ESC_RST_PDI_RST_MASK) >> ESC_ESC_RST_PDI_RST_SHIFT)

/* Bitfield definition for register: ESC_DL_CTRL */
/*
 * SA (RO)
 *
 * Station alias:
 * 0:Ignore Station Alias
 * 1:Alias can be used for all configured
 * address comm
 */
#define ESC_ESC_DL_CTRL_SA_MASK (0x1000000UL)
#define ESC_ESC_DL_CTRL_SA_SHIFT (24U)
#define ESC_ESC_DL_CTRL_SA_GET(x) (((uint32_t)(x) & ESC_ESC_DL_CTRL_SA_MASK) >> ESC_ESC_DL_CTRL_SA_SHIFT)

/*
 * RFS (RO)
 *
 * RX FIFO Size (ESC delays start of
 * forwarding until FIFO is at least half full).
 * RX FIFO Size/RX delay reduction** :
 * Value:EBUS:MII:
 * 0:-50 ns -40 ns (-80 ns***)
 * 1:-40 ns -40 ns (-80 ns***)
 * 2:-30 ns -40 ns
 * 3:-20 ns -40 ns
 * 4:-10 ns no change
 * 5:no change no change
 * 6:no change no change
 * 7:default default
 * NOTE:EEPROM value is only taken over at first
 * EEPROM load after power-on or reset
 */
#define ESC_ESC_DL_CTRL_RFS_MASK (0x70000UL)
#define ESC_ESC_DL_CTRL_RFS_SHIFT (16U)
#define ESC_ESC_DL_CTRL_RFS_GET(x) (((uint32_t)(x) & ESC_ESC_DL_CTRL_RFS_MASK) >> ESC_ESC_DL_CTRL_RFS_SHIFT)

/*
 * LP3 (RO)
 *
 * Loop Port 3:
 * 00:Auto
 * 01:Auto Close
 * 10:Open
 * 11:Closed
 */
#define ESC_ESC_DL_CTRL_LP3_MASK (0xC000U)
#define ESC_ESC_DL_CTRL_LP3_SHIFT (14U)
#define ESC_ESC_DL_CTRL_LP3_GET(x) (((uint32_t)(x) & ESC_ESC_DL_CTRL_LP3_MASK) >> ESC_ESC_DL_CTRL_LP3_SHIFT)

/*
 * LP2 (RO)
 *
 * Loop Port 2:
 * 00:Auto
 * 01:Auto Close
 * 10:Open
 * 11:Closed
 */
#define ESC_ESC_DL_CTRL_LP2_MASK (0x3000U)
#define ESC_ESC_DL_CTRL_LP2_SHIFT (12U)
#define ESC_ESC_DL_CTRL_LP2_GET(x) (((uint32_t)(x) & ESC_ESC_DL_CTRL_LP2_MASK) >> ESC_ESC_DL_CTRL_LP2_SHIFT)

/*
 * LP1 (RO)
 *
 * Loop Port 1:
 * 00:Auto
 * 01:Auto Close
 * 10:Open
 * 11:Closed
 */
#define ESC_ESC_DL_CTRL_LP1_MASK (0xC00U)
#define ESC_ESC_DL_CTRL_LP1_SHIFT (10U)
#define ESC_ESC_DL_CTRL_LP1_GET(x) (((uint32_t)(x) & ESC_ESC_DL_CTRL_LP1_MASK) >> ESC_ESC_DL_CTRL_LP1_SHIFT)

/*
 * LP0 (RO)
 *
 * Loop Port 0:
 * 00:Auto
 * 01:Auto Close
 * 10:Open
 * 11:Closed
 * NOTE:
 * Loop open means sending/receiving over this port
 * is enabled, loop closed means sending/receiving
 * is disabled and frames are forwarded to the next
 * open port internally.
 * Auto:loop closed at link down, opened at link up
 * Auto Close:loop closed at link down, opened with
 * writing 01 again after link up (or receiving a valid
 * Ethernet frame at the closed port)
 * Open:loop open regardless of link state
 * Closed:loop closed regardless of link state
 */
#define ESC_ESC_DL_CTRL_LP0_MASK (0x300U)
#define ESC_ESC_DL_CTRL_LP0_SHIFT (8U)
#define ESC_ESC_DL_CTRL_LP0_GET(x) (((uint32_t)(x) & ESC_ESC_DL_CTRL_LP0_MASK) >> ESC_ESC_DL_CTRL_LP0_SHIFT)

/*
 * TU (RO)
 *
 * Temporary use of settings in
 * 0x0100:0x0103[8:15]:
 * 0:permanent use
 * 1:use for about 1 second, then revert to
 * previous settings
 */
#define ESC_ESC_DL_CTRL_TU_MASK (0x2U)
#define ESC_ESC_DL_CTRL_TU_SHIFT (1U)
#define ESC_ESC_DL_CTRL_TU_GET(x) (((uint32_t)(x) & ESC_ESC_DL_CTRL_TU_MASK) >> ESC_ESC_DL_CTRL_TU_SHIFT)

