hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_esc_regs.h
/*
 * FR (RO)
 *
 * Forwarding rule:
 * 0:Forward non-EtherCAT frames:
 * EtherCAT frames are processed,
 * non-EtherCAT frames are forwarded
 * without processing or modification.
 * The source MAC address is not
 * changed for any frame.
 * 1:Destroy non-EtherCAT frames:
 * EtherCAT frames are processed, non-EtherCAT frames are destroyed.
 * The source MAC address is changed by
 * the Processing Unit for every frame
 * (SOURCE_MAC[1] is set
 */
#define ESC_ESC_DL_CTRL_FR_MASK (0x1U)
#define ESC_ESC_DL_CTRL_FR_SHIFT (0U)
#define ESC_ESC_DL_CTRL_FR_GET(x) (((uint32_t)(x) & ESC_ESC_DL_CTRL_FR_MASK) >> ESC_ESC_DL_CTRL_FR_SHIFT)

/* Bitfield definition for register: PHYSICAL_RW_OFFSET */
/*
 * OFFSET (RO)
 *
 * This register is used for ReadWrite
 * commands in Device Addressing mode
 * (FPRW, APRW, BRW).
 * The internal read address is directly taken
 * from the offset address field of the EtherCAT
 * datagram header, while the internal write
 * address is calculated by adding the Physical
 * Read/Write Offset value to the offset address
 * field.
 * Internal read address = ADR,
 * internal write address = ADR + R/W-Offset
 */
#define ESC_PHYSICAL_RW_OFFSET_OFFSET_MASK (0xFFFFU)
#define ESC_PHYSICAL_RW_OFFSET_OFFSET_SHIFT (0U)
#define ESC_PHYSICAL_RW_OFFSET_OFFSET_GET(x) (((uint16_t)(x) & ESC_PHYSICAL_RW_OFFSET_OFFSET_MASK) >> ESC_PHYSICAL_RW_OFFSET_OFFSET_SHIFT)

/* Bitfield definition for register: ESC_DL_STAT */
/*
 * CP3 (RO)
 *
 * Communication on Port 3:
 * 0:No stable communication
 * 1:Communication established
 */
#define ESC_ESC_DL_STAT_CP3_MASK (0x8000U)
#define ESC_ESC_DL_STAT_CP3_SHIFT (15U)
#define ESC_ESC_DL_STAT_CP3_GET(x) (((uint16_t)(x) & ESC_ESC_DL_STAT_CP3_MASK) >> ESC_ESC_DL_STAT_CP3_SHIFT)

/*
 * LP3 (RO)
 *
 * Loop Port 3:
 * 0:Open
 * 1:Closed
 */
#define ESC_ESC_DL_STAT_LP3_MASK (0x4000U)
#define ESC_ESC_DL_STAT_LP3_SHIFT (14U)
#define ESC_ESC_DL_STAT_LP3_GET(x) (((uint16_t)(x) & ESC_ESC_DL_STAT_LP3_MASK) >> ESC_ESC_DL_STAT_LP3_SHIFT)

/*
 * CP2 (RO)
 *
 * Communication on Port 2:
 * 0:No stable communication
 * 1:Communication established
 */
#define ESC_ESC_DL_STAT_CP2_MASK (0x2000U)
#define ESC_ESC_DL_STAT_CP2_SHIFT (13U)
#define ESC_ESC_DL_STAT_CP2_GET(x) (((uint16_t)(x) & ESC_ESC_DL_STAT_CP2_MASK) >> ESC_ESC_DL_STAT_CP2_SHIFT)

/*
 * LP2 (RO)
 *
 * Loop Port 2:
 * 0:Open
 * 1:Closed
 */
#define ESC_ESC_DL_STAT_LP2_MASK (0x1000U)
#define ESC_ESC_DL_STAT_LP2_SHIFT (12U)
#define ESC_ESC_DL_STAT_LP2_GET(x) (((uint16_t)(x) & ESC_ESC_DL_STAT_LP2_MASK) >> ESC_ESC_DL_STAT_LP2_SHIFT)

/*
 * CP1 (RO)
 *
 * Communication on Port 1:
 * 0:No stable communication
 * 1:Communication established
 */
#define ESC_ESC_DL_STAT_CP1_MASK (0x800U)
#define ESC_ESC_DL_STAT_CP1_SHIFT (11U)
#define ESC_ESC_DL_STAT_CP1_GET(x) (((uint16_t)(x) & ESC_ESC_DL_STAT_CP1_MASK) >> ESC_ESC_DL_STAT_CP1_SHIFT)

/*
 * LP1 (RO)
 *
 * Loop Port 1:
 * 0:Open
 * 1:Closed
 */
#define ESC_ESC_DL_STAT_LP1_MASK (0x400U)
#define ESC_ESC_DL_STAT_LP1_SHIFT (10U)
#define ESC_ESC_DL_STAT_LP1_GET(x) (((uint16_t)(x) & ESC_ESC_DL_STAT_LP1_MASK) >> ESC_ESC_DL_STAT_LP1_SHIFT)

/*
 * CP0 (RO)
 *
 * Communication on Port 0:
 * 0:No stable communication
 * 1:Communication established
 */
#define ESC_ESC_DL_STAT_CP0_MASK (0x200U)
#define ESC_ESC_DL_STAT_CP0_SHIFT (9U)
#define ESC_ESC_DL_STAT_CP0_GET(x) (((uint16_t)(x) & ESC_ESC_DL_STAT_CP0_MASK) >> ESC_ESC_DL_STAT_CP0_SHIFT)

/*
 * LP0 (RO)
 *
 * Loop Port 0:
 * 0:Open
 * 1:Closed
 */
#define ESC_ESC_DL_STAT_LP0_MASK (0x100U)
#define ESC_ESC_DL_STAT_LP0_SHIFT (8U)
#define ESC_ESC_DL_STAT_LP0_GET(x) (((uint16_t)(x) & ESC_ESC_DL_STAT_LP0_MASK) >> ESC_ESC_DL_STAT_LP0_SHIFT)

/*
 * PLP3 (RO)
 *
 * Physical link on Port 3:
 * 0:No link
 * 1:Link detected
 */
#define ESC_ESC_DL_STAT_PLP3_MASK (0x80U)
#define ESC_ESC_DL_STAT_PLP3_SHIFT (7U)
#define ESC_ESC_DL_STAT_PLP3_GET(x) (((uint16_t)(x) & ESC_ESC_DL_STAT_PLP3_MASK) >> ESC_ESC_DL_STAT_PLP3_SHIFT)

/*
 * PLP2 (RO)
 *
 * Physical link on Port 2:
 * 0:No link
 * 1:Link detected
 */
#define ESC_ESC_DL_STAT_PLP2_MASK (0x40U)
#define ESC_ESC_DL_STAT_PLP2_SHIFT (6U)
#define ESC_ESC_DL_STAT_PLP2_GET(x) (((uint16_t)(x) & ESC_ESC_DL_STAT_PLP2_MASK) >> ESC_ESC_DL_STAT_PLP2_SHIFT)

/*
 * PLP1 (RO)
 *
 * Physical link on Port 1:
 * 0:No link
 * 1:Link detected
 */
#define ESC_ESC_DL_STAT_PLP1_MASK (0x20U)
#define ESC_ESC_DL_STAT_PLP1_SHIFT (5U)
#define ESC_ESC_DL_STAT_PLP1_GET(x) (((uint16_t)(x) & ESC_ESC_DL_STAT_PLP1_MASK) >> ESC_ESC_DL_STAT_PLP1_SHIFT)

/*
 * PLP0 (RO)
 *
 * Physical link on Port 0:
 * 0:No link
 * 1:Link detected
 */
#define ESC_ESC_DL_STAT_PLP0_MASK (0x10U)
#define ESC_ESC_DL_STAT_PLP0_SHIFT (4U)
#define ESC_ESC_DL_STAT_PLP0_GET(x) (((uint16_t)(x) & ESC_ESC_DL_STAT_PLP0_MASK) >> ESC_ESC_DL_STAT_PLP0_SHIFT)

/*
 * ELD (RO)
 *
 * Enhanced Link detection:
 * 0:Deactivated for all ports
 * 1:Activated for at least one port
 * NOTE:EEPROM value is only transferred into this
 * register at first EEPROM load after power-on or
 * reset
 */
#define ESC_ESC_DL_STAT_ELD_MASK (0x4U)
#define ESC_ESC_DL_STAT_ELD_SHIFT (2U)
#define ESC_ESC_DL_STAT_ELD_GET(x) (((uint16_t)(x) & ESC_ESC_DL_STAT_ELD_MASK) >> ESC_ESC_DL_STAT_ELD_SHIFT)

/*
 * WDS (RO)
 *
 * PDI Watchdog Status:
 * 0:Watchdog expired
 * 1:Watchdog reloaded
 */
#define ESC_ESC_DL_STAT_WDS_MASK (0x2U)
#define ESC_ESC_DL_STAT_WDS_SHIFT (1U)
#define ESC_ESC_DL_STAT_WDS_GET(x) (((uint16_t)(x) & ESC_ESC_DL_STAT_WDS_MASK) >> ESC_ESC_DL_STAT_WDS_SHIFT)

/*
 * EPLC (RO)
 *
 * PDI operational/EEPROM loaded correctly:
 * 0:EEPROM not loaded, PDI not
 * operational (no access to Process Data
 * RAM)
 * 1:EEPROM loaded correctly, PDI
 * operational (access to Process Data
 * RAM)
 */
#define ESC_ESC_DL_STAT_EPLC_MASK (0x1U)
#define ESC_ESC_DL_STAT_EPLC_SHIFT (0U)
#define ESC_ESC_DL_STAT_EPLC_GET(x) (((uint16_t)(x) & ESC_ESC_DL_STAT_EPLC_MASK) >> ESC_ESC_DL_STAT_EPLC_SHIFT)

/* Bitfield definition for register: AL_CTRL */
/*
 * DI (RW)
 *
 * Device Identification:
 * 0:No request
 * 1:Device Identification request
 */
#define ESC_AL_CTRL_DI_MASK (0x20U)
#define ESC_AL_CTRL_DI_SHIFT (5U)
#define ESC_AL_CTRL_DI_SET(x) (((uint16_t)(x) << ESC_AL_CTRL_DI_SHIFT) & ESC_AL_CTRL_DI_MASK)
#define ESC_AL_CTRL_DI_GET(x) (((uint16_t)(x) & ESC_AL_CTRL_DI_MASK) >> ESC_AL_CTRL_DI_SHIFT)

