hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_esc_regs.h
/*
 * EIA (RW)
 *
 * Error Ind Ack:
 * 0:No Ack of Error Ind in AL status register
 * 1:Ack of Error Ind in AL status register
 */
#define ESC_AL_CTRL_EIA_MASK (0x10U)
#define ESC_AL_CTRL_EIA_SHIFT (4U)
#define ESC_AL_CTRL_EIA_SET(x) (((uint16_t)(x) << ESC_AL_CTRL_EIA_SHIFT) & ESC_AL_CTRL_EIA_MASK)
#define ESC_AL_CTRL_EIA_GET(x) (((uint16_t)(x) & ESC_AL_CTRL_EIA_MASK) >> ESC_AL_CTRL_EIA_SHIFT)

/*
 * IST (RW)
 *
 * Initiate State Transition of the Device State
 * Machine:
 * 1:Request Init State
 * 3:Request Bootstrap State
 * 2:Request Pre-Operational State
 * 4:Request Safe-Operational State
 * 8:Request Operational State
 */
#define ESC_AL_CTRL_IST_MASK (0xFU)
#define ESC_AL_CTRL_IST_SHIFT (0U)
#define ESC_AL_CTRL_IST_SET(x) (((uint16_t)(x) << ESC_AL_CTRL_IST_SHIFT) & ESC_AL_CTRL_IST_MASK)
#define ESC_AL_CTRL_IST_GET(x) (((uint16_t)(x) & ESC_AL_CTRL_IST_MASK) >> ESC_AL_CTRL_IST_SHIFT)

/* Bitfield definition for register: AL_STAT */
/*
 * DI (RW)
 *
 * Device Identification:
 * 0:Device Identification not valid
 * 1:Device Identification loaded
 */
#define ESC_AL_STAT_DI_MASK (0x20U)
#define ESC_AL_STAT_DI_SHIFT (5U)
#define ESC_AL_STAT_DI_SET(x) (((uint16_t)(x) << ESC_AL_STAT_DI_SHIFT) & ESC_AL_STAT_DI_MASK)
#define ESC_AL_STAT_DI_GET(x) (((uint16_t)(x) & ESC_AL_STAT_DI_MASK) >> ESC_AL_STAT_DI_SHIFT)

/*
 * EI (RW)
 *
 * Error Ind:
 * 0:Device is in State as requested or Flag
 * cleared by command
 * 1:Device has not entered requested State
 * or changed State as result of a local
 * action
 */
#define ESC_AL_STAT_EI_MASK (0x10U)
#define ESC_AL_STAT_EI_SHIFT (4U)
#define ESC_AL_STAT_EI_SET(x) (((uint16_t)(x) << ESC_AL_STAT_EI_SHIFT) & ESC_AL_STAT_EI_MASK)
#define ESC_AL_STAT_EI_GET(x) (((uint16_t)(x) & ESC_AL_STAT_EI_MASK) >> ESC_AL_STAT_EI_SHIFT)

/*
 * AS (RW)
 *
 * Actual State of the Device State Machine:
 * 1:Init State
 * 3:Bootstrap State
 * 2:Pre-Operational State
 * 4:Safe-Operational State
 * 8:Operational State
 */
#define ESC_AL_STAT_AS_MASK (0xFU)
#define ESC_AL_STAT_AS_SHIFT (0U)
#define ESC_AL_STAT_AS_SET(x) (((uint16_t)(x) << ESC_AL_STAT_AS_SHIFT) & ESC_AL_STAT_AS_MASK)
#define ESC_AL_STAT_AS_GET(x) (((uint16_t)(x) & ESC_AL_STAT_AS_MASK) >> ESC_AL_STAT_AS_SHIFT)

/* Bitfield definition for register: AL_STAT_CODE */
/*
 * CODE (RW)
 *
 * AL Status Code
 */
#define ESC_AL_STAT_CODE_CODE_MASK (0xFFFFU)
#define ESC_AL_STAT_CODE_CODE_SHIFT (0U)
#define ESC_AL_STAT_CODE_CODE_SET(x) (((uint16_t)(x) << ESC_AL_STAT_CODE_CODE_SHIFT) & ESC_AL_STAT_CODE_CODE_MASK)
#define ESC_AL_STAT_CODE_CODE_GET(x) (((uint16_t)(x) & ESC_AL_STAT_CODE_CODE_MASK) >> ESC_AL_STAT_CODE_CODE_SHIFT)

/* Bitfield definition for register: RUN_LED_OVRD */
/*
 * EN_OVRD (RW)
 *
 * Enable Override:
 * 0:Override disabled
 * 1:Override enabled
 */
#define ESC_RUN_LED_OVRD_EN_OVRD_MASK (0x10U)
#define ESC_RUN_LED_OVRD_EN_OVRD_SHIFT (4U)
#define ESC_RUN_LED_OVRD_EN_OVRD_SET(x) (((uint8_t)(x) << ESC_RUN_LED_OVRD_EN_OVRD_SHIFT) & ESC_RUN_LED_OVRD_EN_OVRD_MASK)
#define ESC_RUN_LED_OVRD_EN_OVRD_GET(x) (((uint8_t)(x) & ESC_RUN_LED_OVRD_EN_OVRD_MASK) >> ESC_RUN_LED_OVRD_EN_OVRD_SHIFT)

/*
 * LED_CODE (RW)
 *
 * LED code:
 * 0x0:Off
 * 0x1:Flash 1x
 * 0x2-0xC:Flash 2x – 12x
 * 0xD:Blinking
 * 0xE:Flickering
 * 0xF:On
 */
#define ESC_RUN_LED_OVRD_LED_CODE_MASK (0xFU)
#define ESC_RUN_LED_OVRD_LED_CODE_SHIFT (0U)
#define ESC_RUN_LED_OVRD_LED_CODE_SET(x) (((uint8_t)(x) << ESC_RUN_LED_OVRD_LED_CODE_SHIFT) & ESC_RUN_LED_OVRD_LED_CODE_MASK)
#define ESC_RUN_LED_OVRD_LED_CODE_GET(x) (((uint8_t)(x) & ESC_RUN_LED_OVRD_LED_CODE_MASK) >> ESC_RUN_LED_OVRD_LED_CODE_SHIFT)

/* Bitfield definition for register: ERR_LED_OVRD */
/*
 * EN_OVRD (RW)
 *
 * Enable Override:
 * 0:Override disabled
 * 1:Override enabled
 */
#define ESC_ERR_LED_OVRD_EN_OVRD_MASK (0x10U)
#define ESC_ERR_LED_OVRD_EN_OVRD_SHIFT (4U)
#define ESC_ERR_LED_OVRD_EN_OVRD_SET(x) (((uint8_t)(x) << ESC_ERR_LED_OVRD_EN_OVRD_SHIFT) & ESC_ERR_LED_OVRD_EN_OVRD_MASK)
#define ESC_ERR_LED_OVRD_EN_OVRD_GET(x) (((uint8_t)(x) & ESC_ERR_LED_OVRD_EN_OVRD_MASK) >> ESC_ERR_LED_OVRD_EN_OVRD_SHIFT)

/*
 * LED_CODE (RW)
 *
 * LED code:
 * 0x0:Off
 * 0x1-0xC:Flash 1x – 12x
 * 0xD:Blinking
 * 0xE:Flickering
 * 0xF:On
 */
#define ESC_ERR_LED_OVRD_LED_CODE_MASK (0xFU)
#define ESC_ERR_LED_OVRD_LED_CODE_SHIFT (0U)
#define ESC_ERR_LED_OVRD_LED_CODE_SET(x) (((uint8_t)(x) << ESC_ERR_LED_OVRD_LED_CODE_SHIFT) & ESC_ERR_LED_OVRD_LED_CODE_MASK)
#define ESC_ERR_LED_OVRD_LED_CODE_GET(x) (((uint8_t)(x) & ESC_ERR_LED_OVRD_LED_CODE_MASK) >> ESC_ERR_LED_OVRD_LED_CODE_SHIFT)

/* Bitfield definition for register: PDI_CTRL */
/*
 * PDI (RO)
 *
 * Process data interface:
 * 0x00:Interface deactivated (no PDI)
 * 0x01:4 Digital Input
 * 0x02:4 Digital Output
 * 0x03:2 Digital Input and 2 Digital Output
 * 0x04:Digital I/O
 * 0x05:SPI Slave
 * 0x06:Oversampling I/O
 * 0x07:EtherCAT Bridge (port 3)
 * 0x08:16 Bit asynchronous Microcontroller
 * interface
 * 0x09:8 Bit asynchronous Microcontroller
 * interface
 * 0x0A:16 Bit synchronous Microcontroller
 * interface
 * 0x0B:8 Bit synchronous Microcontroller
 * interface
 * 0x10:32 Digital Input and 0 Digital Output
 * 0x11:24 Digital Input and 8 Digital Output
 * 0x12:16 Digital Input and 16 Digital Output
 * 0x13:8 Digital Input and 24 Digital Output
 * 0x14:0 Digital Input and 32 Digital Output
 * 0x80:On-chip bus
 * Others:Reserved
 */
#define ESC_PDI_CTRL_PDI_MASK (0xFFU)
#define ESC_PDI_CTRL_PDI_SHIFT (0U)
#define ESC_PDI_CTRL_PDI_GET(x) (((uint8_t)(x) & ESC_PDI_CTRL_PDI_MASK) >> ESC_PDI_CTRL_PDI_SHIFT)

/* Bitfield definition for register: ESC_CFG */
/*
 * ELP3 (RO)
 *
 * Enhanced Link port 3:
 * 0:disabled (if bit 1=0)
 * 1:enabled
 */
#define ESC_ESC_CFG_ELP3_MASK (0x80U)
#define ESC_ESC_CFG_ELP3_SHIFT (7U)
#define ESC_ESC_CFG_ELP3_GET(x) (((uint8_t)(x) & ESC_ESC_CFG_ELP3_MASK) >> ESC_ESC_CFG_ELP3_SHIFT)

/*
 * ELP2 (RO)
 *
 * Enhanced Link port 2:
 * 0:disabled (if bit 1=0)
 * 1:enabled
 */
#define ESC_ESC_CFG_ELP2_MASK (0x40U)
#define ESC_ESC_CFG_ELP2_SHIFT (6U)
#define ESC_ESC_CFG_ELP2_GET(x) (((uint8_t)(x) & ESC_ESC_CFG_ELP2_MASK) >> ESC_ESC_CFG_ELP2_SHIFT)

