hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_esc_regs.h
/*
 * RPS (RO)
 *
 * Read prefetch size (in cycles of PDI width):
 * 0:4 cycles
 * 1:1 cycle (typical)
 * 2:2 cycles
 * 3:Reserved
 */
#define ESC_PDI_EXT_CFG_RPS_MASK (0x3U)
#define ESC_PDI_EXT_CFG_RPS_SHIFT (0U)
#define ESC_PDI_EXT_CFG_RPS_GET(x) (((uint16_t)(x) & ESC_PDI_EXT_CFG_RPS_MASK) >> ESC_PDI_EXT_CFG_RPS_SHIFT)

/* Bitfield definition for register: ECAT_EVT_MSK */
/*
 * MASK (RO)
 *
 * ECAT Event masking of the ECAT Event
 * Request Events for mapping into ECAT event
 * field of EtherCAT frames:
 * 0:Corresponding ECAT Event Request
 * register bit is not mapped
 * 1:Corresponding ECAT Event Request
 * register bit is mapped
 */
#define ESC_ECAT_EVT_MSK_MASK_MASK (0xFFFFU)
#define ESC_ECAT_EVT_MSK_MASK_SHIFT (0U)
#define ESC_ECAT_EVT_MSK_MASK_GET(x) (((uint16_t)(x) & ESC_ECAT_EVT_MSK_MASK_MASK) >> ESC_ECAT_EVT_MSK_MASK_SHIFT)

/* Bitfield definition for register: PDI_AL_EVT_MSK */
/*
 * MASK (RW)
 *
 * AL Event masking of the AL Event Request
 * register Events for mapping to PDI IRQ
 * signal:
 * 0:Corresponding AL Event Request
 * register bit is not mapped
 * 1:Corresponding AL Event Request
 * register bit is mapped
 */
#define ESC_PDI_AL_EVT_MSK_MASK_MASK (0xFFFFFFFFUL)
#define ESC_PDI_AL_EVT_MSK_MASK_SHIFT (0U)
#define ESC_PDI_AL_EVT_MSK_MASK_SET(x) (((uint32_t)(x) << ESC_PDI_AL_EVT_MSK_MASK_SHIFT) & ESC_PDI_AL_EVT_MSK_MASK_MASK)
#define ESC_PDI_AL_EVT_MSK_MASK_GET(x) (((uint32_t)(x) & ESC_PDI_AL_EVT_MSK_MASK_MASK) >> ESC_PDI_AL_EVT_MSK_MASK_SHIFT)

/* Bitfield definition for register: ECAT_EVT_REQ */
/*
 * MV (RO)
 *
 * Mirrors values of each SyncManager Status:
 * 0:No Sync Channel 0 event
 * 1:Sync Channel 0 event pending
 * 0:No Sync Channel 1 event
 * 1:Sync Channel 1 event pending
 * …
 * 0:No Sync Channel 7 event
 * 1:Sync Channel 7 event pending
 */
#define ESC_ECAT_EVT_REQ_MV_MASK (0xFF0U)
#define ESC_ECAT_EVT_REQ_MV_SHIFT (4U)
#define ESC_ECAT_EVT_REQ_MV_GET(x) (((uint16_t)(x) & ESC_ECAT_EVT_REQ_MV_MASK) >> ESC_ECAT_EVT_REQ_MV_SHIFT)

/*
 * ALS_EVT (RO)
 *
 * AL Status event:
 * 0:No change in AL Status
 * 1:AL Status change
 * (Bit is cleared by reading out AL Status
 * 0x0130:0x0131 from ECAT)
 */
#define ESC_ECAT_EVT_REQ_ALS_EVT_MASK (0x8U)
#define ESC_ECAT_EVT_REQ_ALS_EVT_SHIFT (3U)
#define ESC_ECAT_EVT_REQ_ALS_EVT_GET(x) (((uint16_t)(x) & ESC_ECAT_EVT_REQ_ALS_EVT_MASK) >> ESC_ECAT_EVT_REQ_ALS_EVT_SHIFT)

/*
 * DLS_EVT (RO)
 *
 * DL Status event:
 * 0:No change in DL Status
 * 1:DL Status change
 * (Bit is cleared by reading out DL Status
 * 0x0110:0x0111 from ECAT)
 */
#define ESC_ECAT_EVT_REQ_DLS_EVT_MASK (0x4U)
#define ESC_ECAT_EVT_REQ_DLS_EVT_SHIFT (2U)
#define ESC_ECAT_EVT_REQ_DLS_EVT_GET(x) (((uint16_t)(x) & ESC_ECAT_EVT_REQ_DLS_EVT_MASK) >> ESC_ECAT_EVT_REQ_DLS_EVT_SHIFT)

/*
 * DCL_EVT (RO)
 *
 * DC Latch event:
 * 0:No change on DC Latch Inputs
 * 1:At least one change on DC Latch Inputs
 * (Bit is cleared by reading DC Latch event
 * times from ECAT for ECAT-controlled Latch
 * Units, so that Latch 0/1 Status
 * 0x09AE:0x09AF indicates no event)
 */
#define ESC_ECAT_EVT_REQ_DCL_EVT_MASK (0x1U)
#define ESC_ECAT_EVT_REQ_DCL_EVT_SHIFT (0U)
#define ESC_ECAT_EVT_REQ_DCL_EVT_GET(x) (((uint16_t)(x) & ESC_ECAT_EVT_REQ_DCL_EVT_MASK) >> ESC_ECAT_EVT_REQ_DCL_EVT_SHIFT)

/* Bitfield definition for register: AL_EVT_REQ */
/*
 * SM_INT (RO)
 *
 * SyncManager interrupts (SyncManager
 * register offset 0x5, bit [0] or [1]):
 * 0:No SyncManager 0 interrupt
 * 1:SyncManager 0 interrupt pending
 * 0:No SyncManager 1 interrupt
 * 1:SyncManager 1 interrupt pending
 * …
 * 0:No SyncManager 15 interrupt
 * 1:SyncManager 15 interrupt pending
 */
#define ESC_AL_EVT_REQ_SM_INT_MASK (0xFFFF00UL)
#define ESC_AL_EVT_REQ_SM_INT_SHIFT (8U)
#define ESC_AL_EVT_REQ_SM_INT_GET(x) (((uint32_t)(x) & ESC_AL_EVT_REQ_SM_INT_MASK) >> ESC_AL_EVT_REQ_SM_INT_SHIFT)

/*
 * WDG_PD (RO)
 *
 * Watchdog Process Data:
 * 0:Has not expired
 * 1:Has expired
 * (Bit is cleared by reading Watchdog Status
 * Process Data 0x0440 from PDI)
 */
#define ESC_AL_EVT_REQ_WDG_PD_MASK (0x40U)
#define ESC_AL_EVT_REQ_WDG_PD_SHIFT (6U)
#define ESC_AL_EVT_REQ_WDG_PD_GET(x) (((uint32_t)(x) & ESC_AL_EVT_REQ_WDG_PD_MASK) >> ESC_AL_EVT_REQ_WDG_PD_SHIFT)

/*
 * EE_EMU (RO)
 *
 * EEPROM Emulation:
 * 0:No command pending
 * 1:EEPROM command pending
 * (Bit is cleared by acknowledging the
 * command in EEPROM Control/Status
 * register 0x0502:0x0503[10:8] from PDI)
 */
#define ESC_AL_EVT_REQ_EE_EMU_MASK (0x20U)
#define ESC_AL_EVT_REQ_EE_EMU_SHIFT (5U)
#define ESC_AL_EVT_REQ_EE_EMU_GET(x) (((uint32_t)(x) & ESC_AL_EVT_REQ_EE_EMU_MASK) >> ESC_AL_EVT_REQ_EE_EMU_SHIFT)

/*
 * SM_ACT (RO)
 *
 * SyncManager activation register
 * (SyncManager register offset 0x6) changed:
 * 0:No change in any SyncManager
 * 1:At least one SyncManager changed
 * (Bit is cleared by reading SyncManager
 * Activation registers 0x0806 etc. from PDI)
 */
#define ESC_AL_EVT_REQ_SM_ACT_MASK (0x10U)
#define ESC_AL_EVT_REQ_SM_ACT_SHIFT (4U)
#define ESC_AL_EVT_REQ_SM_ACT_GET(x) (((uint32_t)(x) & ESC_AL_EVT_REQ_SM_ACT_MASK) >> ESC_AL_EVT_REQ_SM_ACT_SHIFT)

/*
 * ST_DC_SYNC1 (RO)
 *
 * State of DC SYNC1 (if register
 * 0x0151[7]=1):
 * (Bit is cleared by reading of SYNC1 status
 * 0x098F from PDI, use only in Acknowledge
 * mode)
 */
#define ESC_AL_EVT_REQ_ST_DC_SYNC1_MASK (0x8U)
#define ESC_AL_EVT_REQ_ST_DC_SYNC1_SHIFT (3U)
#define ESC_AL_EVT_REQ_ST_DC_SYNC1_GET(x) (((uint32_t)(x) & ESC_AL_EVT_REQ_ST_DC_SYNC1_MASK) >> ESC_AL_EVT_REQ_ST_DC_SYNC1_SHIFT)

/*
 * ST_DC_SYNC0 (RO)
 *
 * State of DC SYNC0 (if register
 * 0x0151[3]=1):
 * (Bit is cleared by reading SYNC0 status
 * 0x098E from PDI, use only in Acknowledge
 * mode)
 */
#define ESC_AL_EVT_REQ_ST_DC_SYNC0_MASK (0x4U)
#define ESC_AL_EVT_REQ_ST_DC_SYNC0_SHIFT (2U)
#define ESC_AL_EVT_REQ_ST_DC_SYNC0_GET(x) (((uint32_t)(x) & ESC_AL_EVT_REQ_ST_DC_SYNC0_MASK) >> ESC_AL_EVT_REQ_ST_DC_SYNC0_SHIFT)

/*
 * DCL_EVT (RO)
 *
 * DC Latch event:
 * 0:No change on DC Latch Inputs
 * 1:At least one change on DC Latch Inputs
 * (Bit is cleared by reading DC Latch event
 * times from PDI, so that Latch 0/1 Status
 * 0x09AE:0x09AF indicates no event. Available
 * if Latch Unit is PDI-controlled)
 */
#define ESC_AL_EVT_REQ_DCL_EVT_MASK (0x2U)
#define ESC_AL_EVT_REQ_DCL_EVT_SHIFT (1U)
#define ESC_AL_EVT_REQ_DCL_EVT_GET(x) (((uint32_t)(x) & ESC_AL_EVT_REQ_DCL_EVT_MASK) >> ESC_AL_EVT_REQ_DCL_EVT_SHIFT)

