hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_esc_regs.h
/*
 * ALC_EVT (RO)
 *
 * AL Control event:
 * 0:No AL Control Register change
 * 1:AL Control Register has been written3
 * (Bit is cleared by reading AL Control register
 * 0x0120:0x0121 from PDI)
 */
#define ESC_AL_EVT_REQ_ALC_EVT_MASK (0x1U)
#define ESC_AL_EVT_REQ_ALC_EVT_SHIFT (0U)
#define ESC_AL_EVT_REQ_ALC_EVT_GET(x) (((uint32_t)(x) & ESC_AL_EVT_REQ_ALC_EVT_MASK) >> ESC_AL_EVT_REQ_ALC_EVT_SHIFT)

/* Bitfield definition for register array: RX_ERR_CNT */
/*
 * RX_ERR (RO)
 *
 * RX Error counter of Port y (counting is
 * stopped when 0xFF is reached).
 */
#define ESC_RX_ERR_CNT_RX_ERR_MASK (0xFF00U)
#define ESC_RX_ERR_CNT_RX_ERR_SHIFT (8U)
#define ESC_RX_ERR_CNT_RX_ERR_GET(x) (((uint16_t)(x) & ESC_RX_ERR_CNT_RX_ERR_MASK) >> ESC_RX_ERR_CNT_RX_ERR_SHIFT)

/*
 * IVD_FRM (RO)
 *
 * Invalid frame counter of Port y (counting is
 * stopped when 0xFF is reached).
 */
#define ESC_RX_ERR_CNT_IVD_FRM_MASK (0xFFU)
#define ESC_RX_ERR_CNT_IVD_FRM_SHIFT (0U)
#define ESC_RX_ERR_CNT_IVD_FRM_GET(x) (((uint16_t)(x) & ESC_RX_ERR_CNT_IVD_FRM_MASK) >> ESC_RX_ERR_CNT_IVD_FRM_SHIFT)

/* Bitfield definition for register array: FWD_RX_ERR_CNT */
/*
 * ERR_CNT (RO)
 *
 * Forwarded error counter of Port y (counting is
 * stopped when 0xFF is reached).
 */
#define ESC_FWD_RX_ERR_CNT_ERR_CNT_MASK (0xFFU)
#define ESC_FWD_RX_ERR_CNT_ERR_CNT_SHIFT (0U)
#define ESC_FWD_RX_ERR_CNT_ERR_CNT_GET(x) (((uint8_t)(x) & ESC_FWD_RX_ERR_CNT_ERR_CNT_MASK) >> ESC_FWD_RX_ERR_CNT_ERR_CNT_SHIFT)

/* Bitfield definition for register: ECAT_PU_ERR_CNT */
/*
 * CNT (RO)
 *
 * ECAT Processing Unit error counter
 * (counting is stopped when 0xFF is reached).
 * Counts errors of frames passing the
 * Processing Unit.
 */
#define ESC_ECAT_PU_ERR_CNT_CNT_MASK (0xFFU)
#define ESC_ECAT_PU_ERR_CNT_CNT_SHIFT (0U)
#define ESC_ECAT_PU_ERR_CNT_CNT_GET(x) (((uint8_t)(x) & ESC_ECAT_PU_ERR_CNT_CNT_MASK) >> ESC_ECAT_PU_ERR_CNT_CNT_SHIFT)

/* Bitfield definition for register: PDI_ERR_CNT */
/*
 * CNT (RO)
 *
 * PDI Error counter (counting is stopped when
 * 0xFF is reached). Counts if a PDI access has
 * an interface error.
 */
#define ESC_PDI_ERR_CNT_CNT_MASK (0xFFU)
#define ESC_PDI_ERR_CNT_CNT_SHIFT (0U)
#define ESC_PDI_ERR_CNT_CNT_GET(x) (((uint8_t)(x) & ESC_PDI_ERR_CNT_CNT_MASK) >> ESC_PDI_ERR_CNT_CNT_SHIFT)

/* Bitfield definition for register array: LOST_LINK_CNT */
/*
 * CNT (RO)
 *
 * Lost Link counter of Port y (counting is
 * stopped when 0xff is reached). Counts only if
 * port is open and loop is Auto.
 */
#define ESC_LOST_LINK_CNT_CNT_MASK (0xFFU)
#define ESC_LOST_LINK_CNT_CNT_SHIFT (0U)
#define ESC_LOST_LINK_CNT_CNT_GET(x) (((uint8_t)(x) & ESC_LOST_LINK_CNT_CNT_MASK) >> ESC_LOST_LINK_CNT_CNT_SHIFT)

/* Bitfield definition for register: WDG_DIV */
/*
 * DIV (RO)
 *
 * Watchdog divider:Number of 25 MHz tics
 * (minus 2) that represent the basic watchdog
 * increment. (Default value is 100µs = 2498)
 */
#define ESC_WDG_DIV_DIV_MASK (0xFFFFU)
#define ESC_WDG_DIV_DIV_SHIFT (0U)
#define ESC_WDG_DIV_DIV_GET(x) (((uint16_t)(x) & ESC_WDG_DIV_DIV_MASK) >> ESC_WDG_DIV_DIV_SHIFT)

/* Bitfield definition for register: WDG_TIME_PDI */
/*
 * TIME (RO)
 *
 * Watchdog Time PDI:number of basic
 * watchdog increments
 * (Default value with Watchdog divider 100µs
 * means 100ms Watchdog)
 */
#define ESC_WDG_TIME_PDI_TIME_MASK (0xFFFFU)
#define ESC_WDG_TIME_PDI_TIME_SHIFT (0U)
#define ESC_WDG_TIME_PDI_TIME_GET(x) (((uint16_t)(x) & ESC_WDG_TIME_PDI_TIME_MASK) >> ESC_WDG_TIME_PDI_TIME_SHIFT)

/* Bitfield definition for register: WDG_TIME_PDAT */
/*
 * TIME (RO)
 *
 * Watchdog Time Process Data:number of
 * basic watchdog increments
 * (Default value with Watchdog divider 100µs
 * means 100ms Watchdog)
 */
#define ESC_WDG_TIME_PDAT_TIME_MASK (0xFFFFU)
#define ESC_WDG_TIME_PDAT_TIME_SHIFT (0U)
#define ESC_WDG_TIME_PDAT_TIME_GET(x) (((uint16_t)(x) & ESC_WDG_TIME_PDAT_TIME_MASK) >> ESC_WDG_TIME_PDAT_TIME_SHIFT)

/* Bitfield definition for register: WDG_STAT_PDAT */
/*
 * ST (RW)
 *
 * Watchdog Status of Process Data (triggered
 * by SyncManagers)
 * 0:Watchdog Process Data expired
 * 1:Watchdog Process Data is active or
 * disabled
 */
#define ESC_WDG_STAT_PDAT_ST_MASK (0x1U)
#define ESC_WDG_STAT_PDAT_ST_SHIFT (0U)
#define ESC_WDG_STAT_PDAT_ST_SET(x) (((uint16_t)(x) << ESC_WDG_STAT_PDAT_ST_SHIFT) & ESC_WDG_STAT_PDAT_ST_MASK)
#define ESC_WDG_STAT_PDAT_ST_GET(x) (((uint16_t)(x) & ESC_WDG_STAT_PDAT_ST_MASK) >> ESC_WDG_STAT_PDAT_ST_SHIFT)

/* Bitfield definition for register: WDG_CNT_PDAT */
/*
 * CNT (RO)
 *
 * Watchdog Counter Process Data (counting is
 * stopped when 0xFF is reached). Counts if
 * Process Data Watchdog expires.
 */
#define ESC_WDG_CNT_PDAT_CNT_MASK (0xFFU)
#define ESC_WDG_CNT_PDAT_CNT_SHIFT (0U)
#define ESC_WDG_CNT_PDAT_CNT_GET(x) (((uint8_t)(x) & ESC_WDG_CNT_PDAT_CNT_MASK) >> ESC_WDG_CNT_PDAT_CNT_SHIFT)

/* Bitfield definition for register: WDG_CNT_PDI */
/*
 * CNT (RO)
 *
 * Watchdog PDI counter (counting is stopped
 * when 0xFF is reached). Counts if PDI
 * Watchdog expires.
 */
#define ESC_WDG_CNT_PDI_CNT_MASK (0xFFU)
#define ESC_WDG_CNT_PDI_CNT_SHIFT (0U)
#define ESC_WDG_CNT_PDI_CNT_GET(x) (((uint8_t)(x) & ESC_WDG_CNT_PDI_CNT_MASK) >> ESC_WDG_CNT_PDI_CNT_SHIFT)

/* Bitfield definition for register: EEPROM_CFG */
/*
 * FORCE_ECAT (RO)
 *
 * Force ECAT access:
 * 0:Do not change Bit 0x0501[0]
 * 1:Reset Bit 0x0501[0] to 0
 */
#define ESC_EEPROM_CFG_FORCE_ECAT_MASK (0x2U)
#define ESC_EEPROM_CFG_FORCE_ECAT_SHIFT (1U)
#define ESC_EEPROM_CFG_FORCE_ECAT_GET(x) (((uint8_t)(x) & ESC_EEPROM_CFG_FORCE_ECAT_MASK) >> ESC_EEPROM_CFG_FORCE_ECAT_SHIFT)

/*
 * PDI (RO)
 *
 * EEPROM control is offered to PDI:
 * 0:no
 * 1:yes (PDI has EEPROM control)
 */
#define ESC_EEPROM_CFG_PDI_MASK (0x1U)
#define ESC_EEPROM_CFG_PDI_SHIFT (0U)
#define ESC_EEPROM_CFG_PDI_GET(x) (((uint8_t)(x) & ESC_EEPROM_CFG_PDI_MASK) >> ESC_EEPROM_CFG_PDI_SHIFT)

/* Bitfield definition for register: EEPROM_PDI_ACC_STAT */
/*
 * ACCESS (RW)
 *
 * Access to EEPROM:
 * 0:PDI releases EEPROM access
 * 1:PDI takes EEPROM access (PDI has
 * EEPROM control)
 */
#define ESC_EEPROM_PDI_ACC_STAT_ACCESS_MASK (0x1U)
#define ESC_EEPROM_PDI_ACC_STAT_ACCESS_SHIFT (0U)
#define ESC_EEPROM_PDI_ACC_STAT_ACCESS_SET(x) (((uint8_t)(x) << ESC_EEPROM_PDI_ACC_STAT_ACCESS_SHIFT) & ESC_EEPROM_PDI_ACC_STAT_ACCESS_MASK)
#define ESC_EEPROM_PDI_ACC_STAT_ACCESS_GET(x) (((uint8_t)(x) & ESC_EEPROM_PDI_ACC_STAT_ACCESS_MASK) >> ESC_EEPROM_PDI_ACC_STAT_ACCESS_SHIFT)

/* Bitfield definition for register: EEPROM_CTRL_STAT */
/*
 * BUSY (RO)
 *
 * Busy:
 * 0:EEPROM Interface is idle
 * 1:EEPROM Interface is busy
 */
#define ESC_EEPROM_CTRL_STAT_BUSY_MASK (0x8000U)
#define ESC_EEPROM_CTRL_STAT_BUSY_SHIFT (15U)
#define ESC_EEPROM_CTRL_STAT_BUSY_GET(x) (((uint16_t)(x) & ESC_EEPROM_CTRL_STAT_BUSY_MASK) >> ESC_EEPROM_CTRL_STAT_BUSY_SHIFT)

