hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_esc_regs.h
/*
 * ERR_WEN (RO)
 *
 * Error Write Enable*3
 * :
 * 0:No error
 * 1:Write Command without Write enable
 */
#define ESC_EEPROM_CTRL_STAT_ERR_WEN_MASK (0x4000U)
#define ESC_EEPROM_CTRL_STAT_ERR_WEN_SHIFT (14U)
#define ESC_EEPROM_CTRL_STAT_ERR_WEN_GET(x) (((uint16_t)(x) & ESC_EEPROM_CTRL_STAT_ERR_WEN_MASK) >> ESC_EEPROM_CTRL_STAT_ERR_WEN_SHIFT)

/*
 * ERR_ACK_CMD (RW)
 *
 * Error Acknowledge/Command*3
 * :
 * 0:No error
 * 1:Missing EEPROM acknowledge or invalid
 * command
 * EEPROM emulation only:PDI writes 1 if a temporary
 * failure has occurred.
 */
#define ESC_EEPROM_CTRL_STAT_ERR_ACK_CMD_MASK (0x2000U)
#define ESC_EEPROM_CTRL_STAT_ERR_ACK_CMD_SHIFT (13U)
#define ESC_EEPROM_CTRL_STAT_ERR_ACK_CMD_SET(x) (((uint16_t)(x) << ESC_EEPROM_CTRL_STAT_ERR_ACK_CMD_SHIFT) & ESC_EEPROM_CTRL_STAT_ERR_ACK_CMD_MASK)
#define ESC_EEPROM_CTRL_STAT_ERR_ACK_CMD_GET(x) (((uint16_t)(x) & ESC_EEPROM_CTRL_STAT_ERR_ACK_CMD_MASK) >> ESC_EEPROM_CTRL_STAT_ERR_ACK_CMD_SHIFT)

/*
 * EE_LDS (RO)
 *
 * EEPROM loading status:
 * 0:EEPROM loaded, device information ok
 * 1:EEPROM not loaded, device information not
 * available (EEPROM loading in progress or
 * finished with a failure)
 */
#define ESC_EEPROM_CTRL_STAT_EE_LDS_MASK (0x1000U)
#define ESC_EEPROM_CTRL_STAT_EE_LDS_SHIFT (12U)
#define ESC_EEPROM_CTRL_STAT_EE_LDS_GET(x) (((uint16_t)(x) & ESC_EEPROM_CTRL_STAT_EE_LDS_MASK) >> ESC_EEPROM_CTRL_STAT_EE_LDS_SHIFT)

/*
 * CKSM_ERR (RW)
 *
 * Checksum Error in ESC Configuration Area:
 * 0:Checksum ok
 * 1:Checksum error
 * EEPROM emulation for IP Core only:PDI writes 1 if a
 * CRC failure has occurred for a reload command.
 */
#define ESC_EEPROM_CTRL_STAT_CKSM_ERR_MASK (0x800U)
#define ESC_EEPROM_CTRL_STAT_CKSM_ERR_SHIFT (11U)
#define ESC_EEPROM_CTRL_STAT_CKSM_ERR_SET(x) (((uint16_t)(x) << ESC_EEPROM_CTRL_STAT_CKSM_ERR_SHIFT) & ESC_EEPROM_CTRL_STAT_CKSM_ERR_MASK)
#define ESC_EEPROM_CTRL_STAT_CKSM_ERR_GET(x) (((uint16_t)(x) & ESC_EEPROM_CTRL_STAT_CKSM_ERR_MASK) >> ESC_EEPROM_CTRL_STAT_CKSM_ERR_SHIFT)

/*
 * CMD (RW)
 *
 * Command register*2:
 * Write:Initiate command.
 * Read:Currently executed command
 * Commands:
 * 000:No command/EEPROM idle (clear error bits)
 * 001:Read
 * 010:Write
 * 100:Reload
 * Others:Reserved/invalid commands (do not issue)
 * EEPROM emulation only:after execution, PDI writes
 * command value to indicate operation is ready.
 */
#define ESC_EEPROM_CTRL_STAT_CMD_MASK (0x700U)
#define ESC_EEPROM_CTRL_STAT_CMD_SHIFT (8U)
#define ESC_EEPROM_CTRL_STAT_CMD_SET(x) (((uint16_t)(x) << ESC_EEPROM_CTRL_STAT_CMD_SHIFT) & ESC_EEPROM_CTRL_STAT_CMD_MASK)
#define ESC_EEPROM_CTRL_STAT_CMD_GET(x) (((uint16_t)(x) & ESC_EEPROM_CTRL_STAT_CMD_MASK) >> ESC_EEPROM_CTRL_STAT_CMD_SHIFT)

/*
 * EE_ALGM (RO)
 *
 * Selected EEPROM Algorithm:
 * 0:1 address byte (1Kbit – 16Kbit EEPROMs)
 * 1:2 address bytes (32Kbit – 4 Mbit EEPROMs)
 */
#define ESC_EEPROM_CTRL_STAT_EE_ALGM_MASK (0x80U)
#define ESC_EEPROM_CTRL_STAT_EE_ALGM_SHIFT (7U)
#define ESC_EEPROM_CTRL_STAT_EE_ALGM_GET(x) (((uint16_t)(x) & ESC_EEPROM_CTRL_STAT_EE_ALGM_MASK) >> ESC_EEPROM_CTRL_STAT_EE_ALGM_SHIFT)

/*
 * NUM_RD_BYTE (RO)
 *
 * Supported number of EEPROM read bytes:
 * 0:4 Bytes
 * 1:8 Bytes
 */
#define ESC_EEPROM_CTRL_STAT_NUM_RD_BYTE_MASK (0x40U)
#define ESC_EEPROM_CTRL_STAT_NUM_RD_BYTE_SHIFT (6U)
#define ESC_EEPROM_CTRL_STAT_NUM_RD_BYTE_GET(x) (((uint16_t)(x) & ESC_EEPROM_CTRL_STAT_NUM_RD_BYTE_MASK) >> ESC_EEPROM_CTRL_STAT_NUM_RD_BYTE_SHIFT)

/*
 * EE_EMU (RO)
 *
 * EPROM emulation:
 * 0:Normal operation (I²C interface used)
 * 1:PDI emulates EEPROM (I²C not used)
 */
#define ESC_EEPROM_CTRL_STAT_EE_EMU_MASK (0x20U)
#define ESC_EEPROM_CTRL_STAT_EE_EMU_SHIFT (5U)
#define ESC_EEPROM_CTRL_STAT_EE_EMU_GET(x) (((uint16_t)(x) & ESC_EEPROM_CTRL_STAT_EE_EMU_MASK) >> ESC_EEPROM_CTRL_STAT_EE_EMU_SHIFT)

/*
 * ECAT_WEN (RO)
 *
 * ECAT write enable*2
 * :
 * 0:Write requests are disabled
 * 1:Write requests are enabled
 * This bit is always 1 if PDI has EEPROM control.
 */
#define ESC_EEPROM_CTRL_STAT_ECAT_WEN_MASK (0x1U)
#define ESC_EEPROM_CTRL_STAT_ECAT_WEN_SHIFT (0U)
#define ESC_EEPROM_CTRL_STAT_ECAT_WEN_GET(x) (((uint16_t)(x) & ESC_EEPROM_CTRL_STAT_ECAT_WEN_MASK) >> ESC_EEPROM_CTRL_STAT_ECAT_WEN_SHIFT)

/* Bitfield definition for register: EEPROM_ADDR */
/*
 * ADDR (RW)
 *
 * EEPROM Address
 * 0:First word (= 16 bit)
 * 1:Second word
 * …
 * Actually used EEPROM Address bits:
 * 9-0: EEPROM size up to 16 Kbit
 * 17-0: EEPROM size 32 Kbit – 4 Mbit
 * 31-0: EEPROM Emulation
 */
#define ESC_EEPROM_ADDR_ADDR_MASK (0xFFFFFFFFUL)
#define ESC_EEPROM_ADDR_ADDR_SHIFT (0U)
#define ESC_EEPROM_ADDR_ADDR_SET(x) (((uint32_t)(x) << ESC_EEPROM_ADDR_ADDR_SHIFT) & ESC_EEPROM_ADDR_ADDR_MASK)
#define ESC_EEPROM_ADDR_ADDR_GET(x) (((uint32_t)(x) & ESC_EEPROM_ADDR_ADDR_MASK) >> ESC_EEPROM_ADDR_ADDR_SHIFT)

/* Bitfield definition for register: EEPROM_DATA */
/*
 * HI (RW)
 *
 * EEPROM Read data (data read from
 * EEPROM, higher bytes)
 */
#define ESC_EEPROM_DATA_HI_MASK (0xFFFFFFFFFFFF0000ULL)
#define ESC_EEPROM_DATA_HI_SHIFT (16U)
#define ESC_EEPROM_DATA_HI_SET(x) (((uint64_t)(x) << ESC_EEPROM_DATA_HI_SHIFT) & ESC_EEPROM_DATA_HI_MASK)
#define ESC_EEPROM_DATA_HI_GET(x) (((uint64_t)(x) & ESC_EEPROM_DATA_HI_MASK) >> ESC_EEPROM_DATA_HI_SHIFT)

/*
 * LO (RW)
 *
 * EEPROM Write data (data to be written to
 * EEPROM) or
 * EEPROM Read data (data read from
 * EEPROM, lower bytes)
 */
#define ESC_EEPROM_DATA_LO_MASK (0xFFFFU)
#define ESC_EEPROM_DATA_LO_SHIFT (0U)
#define ESC_EEPROM_DATA_LO_SET(x) (((uint64_t)(x) << ESC_EEPROM_DATA_LO_SHIFT) & ESC_EEPROM_DATA_LO_MASK)
#define ESC_EEPROM_DATA_LO_GET(x) (((uint64_t)(x) & ESC_EEPROM_DATA_LO_MASK) >> ESC_EEPROM_DATA_LO_SHIFT)

/* Bitfield definition for register: MII_MNG_CS */
/*
 * BUSY (RO)
 *
 * Busy:
 * 0:MII Management Interface is idle
 * 1:MII Management Interface is busy
 */
#define ESC_MII_MNG_CS_BUSY_MASK (0x8000U)
#define ESC_MII_MNG_CS_BUSY_SHIFT (15U)
#define ESC_MII_MNG_CS_BUSY_GET(x) (((uint16_t)(x) & ESC_MII_MNG_CS_BUSY_MASK) >> ESC_MII_MNG_CS_BUSY_SHIFT)

