hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_esc_regs.h
/* Bitfield definition for register: RCV_TIME_LM */
/*
 * LATCH_MODE (RO)
 *
 * Receive Time Latch Mode:
 * 0:Forwarding mode (used if frames are
 * entering the ESC at port 0 first):
 * Receive time stamps of ports 1-3 are
 * enabled after the write access to
 * 0x0900, so the following frame at ports
 * 1-3 will be time stamped (this is typically
 * the write frame to 0x0900 coming back
 * from the network behind the ESC).
 * 1:Reverse mode (used if frames are
 * entering ESC at port 1-3 first):
 * Receive time stamps of ports 1-3 are
 * immediately taken over from the internal
 * hidden time stamp registers, so the
 * previous frame entering the ESC at
 * ports 1-3 will be time stamped when the
 * write frame to 0x0900 enters port 0 (the
 * previous frame at ports 1-3 is typically
 * the write frame to 0x0900 coming from
 * the master, which will enable time
 * stamp
 */
#define ESC_RCV_TIME_LM_LATCH_MODE_MASK (0x1U)
#define ESC_RCV_TIME_LM_LATCH_MODE_SHIFT (0U)
#define ESC_RCV_TIME_LM_LATCH_MODE_GET(x) (((uint8_t)(x) & ESC_RCV_TIME_LM_LATCH_MODE_MASK) >> ESC_RCV_TIME_LM_LATCH_MODE_SHIFT)

/* Bitfield definition for register: CYC_UNIT_CTRL */
/*
 * LATCHI1 (RO)
 *
 * Latch In unit 1:
 * 0:ECAT-controlled
 * 1:PDI-controlled
 * NOTE:Latch interrupt is routed to ECAT/PDI
 * depending on this setting
 */
#define ESC_CYC_UNIT_CTRL_LATCHI1_MASK (0x20U)
#define ESC_CYC_UNIT_CTRL_LATCHI1_SHIFT (5U)
#define ESC_CYC_UNIT_CTRL_LATCHI1_GET(x) (((uint8_t)(x) & ESC_CYC_UNIT_CTRL_LATCHI1_MASK) >> ESC_CYC_UNIT_CTRL_LATCHI1_SHIFT)

/*
 * LATCHI0 (RO)
 *
 * Latch In unit 0:
 * 0:ECAT-controlled
 * 1:PDI-controlled
 * NOTE:Latch interrupt is routed to ECAT/PDI
 * depending on this setting.
 * Always 1 (PDI-controlled) if System Time is PDIcontrolled.
 */
#define ESC_CYC_UNIT_CTRL_LATCHI0_MASK (0x10U)
#define ESC_CYC_UNIT_CTRL_LATCHI0_SHIFT (4U)
#define ESC_CYC_UNIT_CTRL_LATCHI0_GET(x) (((uint8_t)(x) & ESC_CYC_UNIT_CTRL_LATCHI0_MASK) >> ESC_CYC_UNIT_CTRL_LATCHI0_SHIFT)

/*
 * SYNCO (RO)
 *
 * Cyclic Unit and SYNC0 out unit control:
 * 0:ECAT-controlled
 * 1:PDI-controlled
 */
#define ESC_CYC_UNIT_CTRL_SYNCO_MASK (0x1U)
#define ESC_CYC_UNIT_CTRL_SYNCO_SHIFT (0U)
#define ESC_CYC_UNIT_CTRL_SYNCO_GET(x) (((uint8_t)(x) & ESC_CYC_UNIT_CTRL_SYNCO_MASK) >> ESC_CYC_UNIT_CTRL_SYNCO_SHIFT)

/* Bitfield definition for register: SYNCO_ACT */
/*
 * SSDP (RW)
 *
 * SyncSignal debug pulse (Vasily bit):
 * 0:Deactivated
 * 1:Immediately generate one ping only on
 * SYNC0-1 according to 0x0981[2:1 for
 * debugging
 * This bit is self-clearing, always read 0.
 * All pulses are generated at the same time,
 * the cycle time is ignored. The configured
 * pulse length is used.
 */
#define ESC_SYNCO_ACT_SSDP_MASK (0x80U)
#define ESC_SYNCO_ACT_SSDP_SHIFT (7U)
#define ESC_SYNCO_ACT_SSDP_SET(x) (((uint8_t)(x) << ESC_SYNCO_ACT_SSDP_SHIFT) & ESC_SYNCO_ACT_SSDP_MASK)
#define ESC_SYNCO_ACT_SSDP_GET(x) (((uint8_t)(x) & ESC_SYNCO_ACT_SSDP_MASK) >> ESC_SYNCO_ACT_SSDP_SHIFT)

/*
 * NFC (RW)
 *
 * Near future configuration (approx.):
 * 0:½ DC width future (231 ns or 263 ns)
 * 1:~2.1 sec. future (231 ns)
 */
#define ESC_SYNCO_ACT_NFC_MASK (0x40U)
#define ESC_SYNCO_ACT_NFC_SHIFT (6U)
#define ESC_SYNCO_ACT_NFC_SET(x) (((uint8_t)(x) << ESC_SYNCO_ACT_NFC_SHIFT) & ESC_SYNCO_ACT_NFC_MASK)
#define ESC_SYNCO_ACT_NFC_GET(x) (((uint8_t)(x) & ESC_SYNCO_ACT_NFC_MASK) >> ESC_SYNCO_ACT_NFC_SHIFT)

/*
 * STPC (RW)
 *
 * Start Time plausibility check:
 * 0:Disabled. SyncSignal generation if Start
 * Time is reached.
 * 1:Immediate SyncSignal generation if
 * Start Time is outside near future (see
 * 0x0981[6])
 */
#define ESC_SYNCO_ACT_STPC_MASK (0x20U)
#define ESC_SYNCO_ACT_STPC_SHIFT (5U)
#define ESC_SYNCO_ACT_STPC_SET(x) (((uint8_t)(x) << ESC_SYNCO_ACT_STPC_SHIFT) & ESC_SYNCO_ACT_STPC_MASK)
#define ESC_SYNCO_ACT_STPC_GET(x) (((uint8_t)(x) & ESC_SYNCO_ACT_STPC_MASK) >> ESC_SYNCO_ACT_STPC_SHIFT)

/*
 * EXT (RW)
 *
 * Extension of Start Time Cyclic Operation
 * (0x0990:0x0993):
 * 0:No extension
 * 1:Extend 32 bit written Start Time to 64 bit
 */
#define ESC_SYNCO_ACT_EXT_MASK (0x10U)
#define ESC_SYNCO_ACT_EXT_SHIFT (4U)
#define ESC_SYNCO_ACT_EXT_SET(x) (((uint8_t)(x) << ESC_SYNCO_ACT_EXT_SHIFT) & ESC_SYNCO_ACT_EXT_MASK)
#define ESC_SYNCO_ACT_EXT_GET(x) (((uint8_t)(x) & ESC_SYNCO_ACT_EXT_MASK) >> ESC_SYNCO_ACT_EXT_SHIFT)

/*
 * AC (RW)
 *
 * Auto-activation by writing Start Time Cyclic
 * Operation (0x0990:0x0997):
 * 0:Disabled
 * 1:Auto-activation enabled. 0x0981[0] is
 * set automatically after Start Time is
 * written.
 */
#define ESC_SYNCO_ACT_AC_MASK (0x8U)
#define ESC_SYNCO_ACT_AC_SHIFT (3U)
#define ESC_SYNCO_ACT_AC_SET(x) (((uint8_t)(x) << ESC_SYNCO_ACT_AC_SHIFT) & ESC_SYNCO_ACT_AC_MASK)
#define ESC_SYNCO_ACT_AC_GET(x) (((uint8_t)(x) & ESC_SYNCO_ACT_AC_MASK) >> ESC_SYNCO_ACT_AC_SHIFT)

/*
 * SYNC1_GEN (RW)
 *
 * SYNC1 generation:
 * 0:Deactivated
 * 1:SYNC1 pulse is generated
 */
#define ESC_SYNCO_ACT_SYNC1_GEN_MASK (0x4U)
#define ESC_SYNCO_ACT_SYNC1_GEN_SHIFT (2U)
#define ESC_SYNCO_ACT_SYNC1_GEN_SET(x) (((uint8_t)(x) << ESC_SYNCO_ACT_SYNC1_GEN_SHIFT) & ESC_SYNCO_ACT_SYNC1_GEN_MASK)
#define ESC_SYNCO_ACT_SYNC1_GEN_GET(x) (((uint8_t)(x) & ESC_SYNCO_ACT_SYNC1_GEN_MASK) >> ESC_SYNCO_ACT_SYNC1_GEN_SHIFT)

/*
 * SYNC0_GEN (RW)
 *
 * SYNC0 generation:
 * 0:Deactivated
 * 1:SYNC0 pulse is generated
 */
#define ESC_SYNCO_ACT_SYNC0_GEN_MASK (0x2U)
#define ESC_SYNCO_ACT_SYNC0_GEN_SHIFT (1U)
#define ESC_SYNCO_ACT_SYNC0_GEN_SET(x) (((uint8_t)(x) << ESC_SYNCO_ACT_SYNC0_GEN_SHIFT) & ESC_SYNCO_ACT_SYNC0_GEN_MASK)
#define ESC_SYNCO_ACT_SYNC0_GEN_GET(x) (((uint8_t)(x) & ESC_SYNCO_ACT_SYNC0_GEN_MASK) >> ESC_SYNCO_ACT_SYNC0_GEN_SHIFT)

/*
 * SOUA (RW)
 *
 * Sync Out Unit activation:
 * 0:Deactivated
 * 1:Activated
 */
#define ESC_SYNCO_ACT_SOUA_MASK (0x1U)
#define ESC_SYNCO_ACT_SOUA_SHIFT (0U)
#define ESC_SYNCO_ACT_SOUA_SET(x) (((uint8_t)(x) << ESC_SYNCO_ACT_SOUA_SHIFT) & ESC_SYNCO_ACT_SOUA_MASK)
#define ESC_SYNCO_ACT_SOUA_GET(x) (((uint8_t)(x) & ESC_SYNCO_ACT_SOUA_MASK) >> ESC_SYNCO_ACT_SOUA_SHIFT)

