hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_esc_regs.h
/* Bitfield definition for register: PULSE_LEN */
/*
 * LEN (RO)
 *
 * Pulse length of SyncSignals (in Units of
 * 10ns)
 * 0:Acknowledge mode:SyncSignal will be
 * cleared by reading SYNC[1:0] Status
 * register
 */
#define ESC_PULSE_LEN_LEN_MASK (0xFFFFU)
#define ESC_PULSE_LEN_LEN_SHIFT (0U)
#define ESC_PULSE_LEN_LEN_GET(x) (((uint16_t)(x) & ESC_PULSE_LEN_LEN_MASK) >> ESC_PULSE_LEN_LEN_SHIFT)

/* Bitfield definition for register: ACT_STAT */
/*
 * CHK_RSLT (RO)
 *
 * Start Time Cyclic Operation (0x0990:0x0997)
 * plausibility check result when Sync Out Unit
 * was activated:
 * 0:Start Time was within near future
 * 1:Start Time was out of near future
 * (0x0981[6])
 */
#define ESC_ACT_STAT_CHK_RSLT_MASK (0x4U)
#define ESC_ACT_STAT_CHK_RSLT_SHIFT (2U)
#define ESC_ACT_STAT_CHK_RSLT_GET(x) (((uint8_t)(x) & ESC_ACT_STAT_CHK_RSLT_MASK) >> ESC_ACT_STAT_CHK_RSLT_SHIFT)

/*
 * SYNC1 (RO)
 *
 * SYNC1 activation state:
 * 0:First SYNC1 pulse is not pending
 * 1:First SYNC1 pulse is pending
 */
#define ESC_ACT_STAT_SYNC1_MASK (0x2U)
#define ESC_ACT_STAT_SYNC1_SHIFT (1U)
#define ESC_ACT_STAT_SYNC1_GET(x) (((uint8_t)(x) & ESC_ACT_STAT_SYNC1_MASK) >> ESC_ACT_STAT_SYNC1_SHIFT)

/*
 * SYNC0 (RO)
 *
 * SYNC0 activation state:
 * 0:First SYNC0 pulse is not pending
 * 1:First SYNC0 pulse is pending
 */
#define ESC_ACT_STAT_SYNC0_MASK (0x1U)
#define ESC_ACT_STAT_SYNC0_SHIFT (0U)
#define ESC_ACT_STAT_SYNC0_GET(x) (((uint8_t)(x) & ESC_ACT_STAT_SYNC0_MASK) >> ESC_ACT_STAT_SYNC0_SHIFT)

/* Bitfield definition for register: SYNC0_STAT */
/*
 * ACK (RW)
 *
 * SYNC0 state for Acknowledge mode.
 * SYNC0 in Acknowledge mode is cleared by
 * reading this register from PDI, use only in
 * Acknowledge mode
 */
#define ESC_SYNC0_STAT_ACK_MASK (0x1U)
#define ESC_SYNC0_STAT_ACK_SHIFT (0U)
#define ESC_SYNC0_STAT_ACK_SET(x) (((uint8_t)(x) << ESC_SYNC0_STAT_ACK_SHIFT) & ESC_SYNC0_STAT_ACK_MASK)
#define ESC_SYNC0_STAT_ACK_GET(x) (((uint8_t)(x) & ESC_SYNC0_STAT_ACK_MASK) >> ESC_SYNC0_STAT_ACK_SHIFT)

/* Bitfield definition for register: SYNC1_STAT */
/*
 * ACK (RW)
 *
 * SYNC1 state for Acknowledge mode.
 * SYNC1 in Acknowledge mode is cleared by
 * reading this register from PDI, use only in
 * Acknowledge mode
 */
#define ESC_SYNC1_STAT_ACK_MASK (0x1U)
#define ESC_SYNC1_STAT_ACK_SHIFT (0U)
#define ESC_SYNC1_STAT_ACK_SET(x) (((uint8_t)(x) << ESC_SYNC1_STAT_ACK_SHIFT) & ESC_SYNC1_STAT_ACK_MASK)
#define ESC_SYNC1_STAT_ACK_GET(x) (((uint8_t)(x) & ESC_SYNC1_STAT_ACK_MASK) >> ESC_SYNC1_STAT_ACK_SHIFT)

/* Bitfield definition for register: START_TIME_CO */
/*
 * ST (RW)
 *
 * Write:Start time (System time) of cyclic
 * operation in ns
 * Read:System time of next SYNC0 pulse in
 * ns
 */
#define ESC_START_TIME_CO_ST_MASK (0xFFFFFFFFFFFFFFFFULL)
#define ESC_START_TIME_CO_ST_SHIFT (0U)
#define ESC_START_TIME_CO_ST_SET(x) (((uint64_t)(x) << ESC_START_TIME_CO_ST_SHIFT) & ESC_START_TIME_CO_ST_MASK)
#define ESC_START_TIME_CO_ST_GET(x) (((uint64_t)(x) & ESC_START_TIME_CO_ST_MASK) >> ESC_START_TIME_CO_ST_SHIFT)

/* Bitfield definition for register: NXT_SYNC1_PULSE */
/*
 * TIME (RO)
 *
 * System time of next SYNC1 pulse in ns
 */
#define ESC_NXT_SYNC1_PULSE_TIME_MASK (0xFFFFFFFFFFFFFFFFULL)
#define ESC_NXT_SYNC1_PULSE_TIME_SHIFT (0U)
#define ESC_NXT_SYNC1_PULSE_TIME_GET(x) (((uint64_t)(x) & ESC_NXT_SYNC1_PULSE_TIME_MASK) >> ESC_NXT_SYNC1_PULSE_TIME_SHIFT)

/* Bitfield definition for register: SYNC0_CYC_TIME */
/*
 * CYC (RW)
 *
 * Time between two consecutive SYNC0
 * pulses in ns.
 * 0:Single shot mode, generate only one
 * SYNC0 pulse.
 */
#define ESC_SYNC0_CYC_TIME_CYC_MASK (0xFFFFFFFFUL)
#define ESC_SYNC0_CYC_TIME_CYC_SHIFT (0U)
#define ESC_SYNC0_CYC_TIME_CYC_SET(x) (((uint32_t)(x) << ESC_SYNC0_CYC_TIME_CYC_SHIFT) & ESC_SYNC0_CYC_TIME_CYC_MASK)
#define ESC_SYNC0_CYC_TIME_CYC_GET(x) (((uint32_t)(x) & ESC_SYNC0_CYC_TIME_CYC_MASK) >> ESC_SYNC0_CYC_TIME_CYC_SHIFT)

/* Bitfield definition for register: SYNC1_CYC_TIME */
/*
 * CYC (RW)
 *
 * Time between SYNC0 pulse and SYNC1
 * pulse in ns
 */
#define ESC_SYNC1_CYC_TIME_CYC_MASK (0xFFFFFFFFUL)
#define ESC_SYNC1_CYC_TIME_CYC_SHIFT (0U)
#define ESC_SYNC1_CYC_TIME_CYC_SET(x) (((uint32_t)(x) << ESC_SYNC1_CYC_TIME_CYC_SHIFT) & ESC_SYNC1_CYC_TIME_CYC_MASK)
#define ESC_SYNC1_CYC_TIME_CYC_GET(x) (((uint32_t)(x) & ESC_SYNC1_CYC_TIME_CYC_MASK) >> ESC_SYNC1_CYC_TIME_CYC_SHIFT)

/* Bitfield definition for register: LATCH0_CTRL */
/*
 * NEG_EDGE (RW)
 *
 * Latch0 negative edge:
 * 0:Continuous Latch active
 * 1:Single event (only first event active)
 */
#define ESC_LATCH0_CTRL_NEG_EDGE_MASK (0x2U)
#define ESC_LATCH0_CTRL_NEG_EDGE_SHIFT (1U)
#define ESC_LATCH0_CTRL_NEG_EDGE_SET(x) (((uint8_t)(x) << ESC_LATCH0_CTRL_NEG_EDGE_SHIFT) & ESC_LATCH0_CTRL_NEG_EDGE_MASK)
#define ESC_LATCH0_CTRL_NEG_EDGE_GET(x) (((uint8_t)(x) & ESC_LATCH0_CTRL_NEG_EDGE_MASK) >> ESC_LATCH0_CTRL_NEG_EDGE_SHIFT)

/*
 * POS_EDGE (RW)
 *
 * Latch0 positive edge:
 * 0:Continuous Latch active
 * 1:Single event (only first event active)
 */
#define ESC_LATCH0_CTRL_POS_EDGE_MASK (0x1U)
#define ESC_LATCH0_CTRL_POS_EDGE_SHIFT (0U)
#define ESC_LATCH0_CTRL_POS_EDGE_SET(x) (((uint8_t)(x) << ESC_LATCH0_CTRL_POS_EDGE_SHIFT) & ESC_LATCH0_CTRL_POS_EDGE_MASK)
#define ESC_LATCH0_CTRL_POS_EDGE_GET(x) (((uint8_t)(x) & ESC_LATCH0_CTRL_POS_EDGE_MASK) >> ESC_LATCH0_CTRL_POS_EDGE_SHIFT)

/* Bitfield definition for register: LATCH1_CTRL */
/*
 * NEG_EDGE (RW)
 *
 * Latch1 negative edge:
 * 0:Continuous Latch active
 * 1:Single event (only first event active)
 */
#define ESC_LATCH1_CTRL_NEG_EDGE_MASK (0x2U)
#define ESC_LATCH1_CTRL_NEG_EDGE_SHIFT (1U)
#define ESC_LATCH1_CTRL_NEG_EDGE_SET(x) (((uint8_t)(x) << ESC_LATCH1_CTRL_NEG_EDGE_SHIFT) & ESC_LATCH1_CTRL_NEG_EDGE_MASK)
#define ESC_LATCH1_CTRL_NEG_EDGE_GET(x) (((uint8_t)(x) & ESC_LATCH1_CTRL_NEG_EDGE_MASK) >> ESC_LATCH1_CTRL_NEG_EDGE_SHIFT)

/*
 * POS_EDGE (RW)
 *
 * Latch1 positive edge:
 * 0:Continuous Latch active
 * 1:Single event (only first event active)
 */
#define ESC_LATCH1_CTRL_POS_EDGE_MASK (0x1U)
#define ESC_LATCH1_CTRL_POS_EDGE_SHIFT (0U)
#define ESC_LATCH1_CTRL_POS_EDGE_SET(x) (((uint8_t)(x) << ESC_LATCH1_CTRL_POS_EDGE_SHIFT) & ESC_LATCH1_CTRL_POS_EDGE_MASK)
#define ESC_LATCH1_CTRL_POS_EDGE_GET(x) (((uint8_t)(x) & ESC_LATCH1_CTRL_POS_EDGE_MASK) >> ESC_LATCH1_CTRL_POS_EDGE_SHIFT)

/* Bitfield definition for register: LATCH0_STAT */
/*
 * PIN_STAT (RO)
 *
 * Latch0 pin state
 */
#define ESC_LATCH0_STAT_PIN_STAT_MASK (0x4U)
#define ESC_LATCH0_STAT_PIN_STAT_SHIFT (2U)
#define ESC_LATCH0_STAT_PIN_STAT_GET(x) (((uint8_t)(x) & ESC_LATCH0_STAT_PIN_STAT_MASK) >> ESC_LATCH0_STAT_PIN_STAT_SHIFT)

