hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_esc_regs.h
/*
 * ELDE (RW)
 *
 * Enhanced Link Detection EBUS
 */
#define ESC_USER_RAM_BYTE3_ELDE_MASK (0x40U)
#define ESC_USER_RAM_BYTE3_ELDE_SHIFT (6U)
#define ESC_USER_RAM_BYTE3_ELDE_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE3_ELDE_SHIFT) & ESC_USER_RAM_BYTE3_ELDE_MASK)
#define ESC_USER_RAM_BYTE3_ELDE_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE3_ELDE_MASK) >> ESC_USER_RAM_BYTE3_ELDE_SHIFT)

/*
 * ELDM (RW)
 *
 * Enhanced Link Detection MII
 */
#define ESC_USER_RAM_BYTE3_ELDM_MASK (0x20U)
#define ESC_USER_RAM_BYTE3_ELDM_SHIFT (5U)
#define ESC_USER_RAM_BYTE3_ELDM_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE3_ELDM_SHIFT) & ESC_USER_RAM_BYTE3_ELDM_MASK)
#define ESC_USER_RAM_BYTE3_ELDM_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE3_ELDM_MASK) >> ESC_USER_RAM_BYTE3_ELDM_SHIFT)

/*
 * MMI (RW)
 *
 * MII Management Interface (0x0510:0x0515)
 */
#define ESC_USER_RAM_BYTE3_MMI_MASK (0x10U)
#define ESC_USER_RAM_BYTE3_MMI_SHIFT (4U)
#define ESC_USER_RAM_BYTE3_MMI_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE3_MMI_SHIFT) & ESC_USER_RAM_BYTE3_MMI_MASK)
#define ESC_USER_RAM_BYTE3_MMI_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE3_MMI_MASK) >> ESC_USER_RAM_BYTE3_MMI_SHIFT)

/*
 * LLC (RW)
 *
 * Lost Link Counter (0x0310:0x0313)
 */
#define ESC_USER_RAM_BYTE3_LLC_MASK (0x8U)
#define ESC_USER_RAM_BYTE3_LLC_SHIFT (3U)
#define ESC_USER_RAM_BYTE3_LLC_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE3_LLC_SHIFT) & ESC_USER_RAM_BYTE3_LLC_MASK)
#define ESC_USER_RAM_BYTE3_LLC_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE3_LLC_MASK) >> ESC_USER_RAM_BYTE3_LLC_SHIFT)

/* Bitfield definition for register: USER_RAM_BYTE4 */
/*
 * LDCM (RW)
 *
 * Link detection and configuration by MI
 */
#define ESC_USER_RAM_BYTE4_LDCM_MASK (0x80U)
#define ESC_USER_RAM_BYTE4_LDCM_SHIFT (7U)
#define ESC_USER_RAM_BYTE4_LDCM_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE4_LDCM_SHIFT) & ESC_USER_RAM_BYTE4_LDCM_MASK)
#define ESC_USER_RAM_BYTE4_LDCM_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE4_LDCM_MASK) >> ESC_USER_RAM_BYTE4_LDCM_SHIFT)

/*
 * DTLC (RW)
 *
 * DC Time loop control assigned to PDI
 */
#define ESC_USER_RAM_BYTE4_DTLC_MASK (0x40U)
#define ESC_USER_RAM_BYTE4_DTLC_SHIFT (6U)
#define ESC_USER_RAM_BYTE4_DTLC_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE4_DTLC_SHIFT) & ESC_USER_RAM_BYTE4_DTLC_MASK)
#define ESC_USER_RAM_BYTE4_DTLC_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE4_DTLC_MASK) >> ESC_USER_RAM_BYTE4_DTLC_SHIFT)

/*
 * DSOU (RW)
 *
 * DC Sync Out Unit
 */
#define ESC_USER_RAM_BYTE4_DSOU_MASK (0x20U)
#define ESC_USER_RAM_BYTE4_DSOU_SHIFT (5U)
#define ESC_USER_RAM_BYTE4_DSOU_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE4_DSOU_SHIFT) & ESC_USER_RAM_BYTE4_DSOU_MASK)
#define ESC_USER_RAM_BYTE4_DSOU_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE4_DSOU_MASK) >> ESC_USER_RAM_BYTE4_DSOU_SHIFT)

/*
 * DLIU (RW)
 *
 * DC Latch In Unit
 */
#define ESC_USER_RAM_BYTE4_DLIU_MASK (0x8U)
#define ESC_USER_RAM_BYTE4_DLIU_SHIFT (3U)
#define ESC_USER_RAM_BYTE4_DLIU_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE4_DLIU_SHIFT) & ESC_USER_RAM_BYTE4_DLIU_MASK)
#define ESC_USER_RAM_BYTE4_DLIU_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE4_DLIU_MASK) >> ESC_USER_RAM_BYTE4_DLIU_SHIFT)

/*
 * LALED (RW)
 *
 * Link/Activity LED
 */
#define ESC_USER_RAM_BYTE4_LALED_MASK (0x1U)
#define ESC_USER_RAM_BYTE4_LALED_SHIFT (0U)
#define ESC_USER_RAM_BYTE4_LALED_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE4_LALED_SHIFT) & ESC_USER_RAM_BYTE4_LALED_MASK)
#define ESC_USER_RAM_BYTE4_LALED_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE4_LALED_MASK) >> ESC_USER_RAM_BYTE4_LALED_SHIFT)

/* Bitfield definition for register: USER_RAM_BYTE5 */
/*
 * DDIOR (RW)
 *
 * Disable Digital I/O register (0x0F00:0x0F03)
 */
#define ESC_USER_RAM_BYTE5_DDIOR_MASK (0x20U)
#define ESC_USER_RAM_BYTE5_DDIOR_SHIFT (5U)
#define ESC_USER_RAM_BYTE5_DDIOR_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE5_DDIOR_SHIFT) & ESC_USER_RAM_BYTE5_DDIOR_MASK)
#define ESC_USER_RAM_BYTE5_DDIOR_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE5_DDIOR_MASK) >> ESC_USER_RAM_BYTE5_DDIOR_SHIFT)

/*
 * EEU (RW)
 *
 * EEPROM emulation by µController
 */
#define ESC_USER_RAM_BYTE5_EEU_MASK (0x4U)
#define ESC_USER_RAM_BYTE5_EEU_SHIFT (2U)
#define ESC_USER_RAM_BYTE5_EEU_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE5_EEU_SHIFT) & ESC_USER_RAM_BYTE5_EEU_MASK)
#define ESC_USER_RAM_BYTE5_EEU_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE5_EEU_MASK) >> ESC_USER_RAM_BYTE5_EEU_SHIFT)

/*
 * ATS (RW)
 *
 * Automatic TX shift
 */
#define ESC_USER_RAM_BYTE5_ATS_MASK (0x2U)
#define ESC_USER_RAM_BYTE5_ATS_SHIFT (1U)
#define ESC_USER_RAM_BYTE5_ATS_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE5_ATS_SHIFT) & ESC_USER_RAM_BYTE5_ATS_MASK)
#define ESC_USER_RAM_BYTE5_ATS_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE5_ATS_MASK) >> ESC_USER_RAM_BYTE5_ATS_SHIFT)

/*
 * MCPP (RW)
 *
 * MI control by PDI possible
 */
#define ESC_USER_RAM_BYTE5_MCPP_MASK (0x1U)
#define ESC_USER_RAM_BYTE5_MCPP_SHIFT (0U)
#define ESC_USER_RAM_BYTE5_MCPP_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE5_MCPP_SHIFT) & ESC_USER_RAM_BYTE5_MCPP_MASK)
#define ESC_USER_RAM_BYTE5_MCPP_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE5_MCPP_MASK) >> ESC_USER_RAM_BYTE5_MCPP_SHIFT)

/* Bitfield definition for register: USER_RAM_BYTE6 */
/*
 * RELEDOR (RW)
 *
 * RUN/ERR LED Override (0x0138:0x0139)
 */
#define ESC_USER_RAM_BYTE6_RELEDOR_MASK (0x4U)
#define ESC_USER_RAM_BYTE6_RELEDOR_SHIFT (2U)
#define ESC_USER_RAM_BYTE6_RELEDOR_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE6_RELEDOR_SHIFT) & ESC_USER_RAM_BYTE6_RELEDOR_MASK)
#define ESC_USER_RAM_BYTE6_RELEDOR_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE6_RELEDOR_MASK) >> ESC_USER_RAM_BYTE6_RELEDOR_SHIFT)

/* Bitfield definition for register: USER_RAM_BYTE7 */
/*
 * DCST (RW)
 *
 * DC System Time (0x0910:0x0936)
 */
#define ESC_USER_RAM_BYTE7_DCST_MASK (0x80U)
#define ESC_USER_RAM_BYTE7_DCST_SHIFT (7U)
#define ESC_USER_RAM_BYTE7_DCST_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE7_DCST_SHIFT) & ESC_USER_RAM_BYTE7_DCST_MASK)
#define ESC_USER_RAM_BYTE7_DCST_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE7_DCST_MASK) >> ESC_USER_RAM_BYTE7_DCST_SHIFT)

/*
 * DCRT (RW)
 *
 * DC Receive Times (0x0900:0x090F)
 */
#define ESC_USER_RAM_BYTE7_DCRT_MASK (0x40U)
#define ESC_USER_RAM_BYTE7_DCRT_SHIFT (6U)
#define ESC_USER_RAM_BYTE7_DCRT_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE7_DCRT_SHIFT) & ESC_USER_RAM_BYTE7_DCRT_MASK)
#define ESC_USER_RAM_BYTE7_DCRT_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE7_DCRT_MASK) >> ESC_USER_RAM_BYTE7_DCRT_SHIFT)

