hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_esc_regs.h
/*
 * DIOPDI (RW)
 *
 * Digital I/O PDI
 */
#define ESC_USER_RAM_BYTE15_DIOPDI_MASK (0x4U)
#define ESC_USER_RAM_BYTE15_DIOPDI_SHIFT (2U)
#define ESC_USER_RAM_BYTE15_DIOPDI_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE15_DIOPDI_SHIFT) & ESC_USER_RAM_BYTE15_DIOPDI_MASK)
#define ESC_USER_RAM_BYTE15_DIOPDI_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE15_DIOPDI_MASK) >> ESC_USER_RAM_BYTE15_DIOPDI_SHIFT)

/* Bitfield definition for register: USER_RAM_BYTE19 */
/*
 * SCP (RW)
 *
 * Security CPLD protection
 */
#define ESC_USER_RAM_BYTE19_SCP_MASK (0x40U)
#define ESC_USER_RAM_BYTE19_SCP_SHIFT (6U)
#define ESC_USER_RAM_BYTE19_SCP_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE19_SCP_SHIFT) & ESC_USER_RAM_BYTE19_SCP_MASK)
#define ESC_USER_RAM_BYTE19_SCP_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE19_SCP_MASK) >> ESC_USER_RAM_BYTE19_SCP_SHIFT)

/*
 * RMII (RW)
 *
 * RMII
 */
#define ESC_USER_RAM_BYTE19_RMII_MASK (0x20U)
#define ESC_USER_RAM_BYTE19_RMII_SHIFT (5U)
#define ESC_USER_RAM_BYTE19_RMII_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE19_RMII_SHIFT) & ESC_USER_RAM_BYTE19_RMII_MASK)
#define ESC_USER_RAM_BYTE19_RMII_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE19_RMII_MASK) >> ESC_USER_RAM_BYTE19_RMII_SHIFT)

/*
 * URGP (RW)
 *
 * Use RGMII GTX_CLK phase shifted clock input
 */
#define ESC_USER_RAM_BYTE19_URGP_MASK (0x10U)
#define ESC_USER_RAM_BYTE19_URGP_SHIFT (4U)
#define ESC_USER_RAM_BYTE19_URGP_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE19_URGP_SHIFT) & ESC_USER_RAM_BYTE19_URGP_MASK)
#define ESC_USER_RAM_BYTE19_URGP_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE19_URGP_MASK) >> ESC_USER_RAM_BYTE19_URGP_SHIFT)

/*
 * CIA (RW)
 *
 * CLK_PDI_EXT is asynchronous
 */
#define ESC_USER_RAM_BYTE19_CIA_MASK (0x4U)
#define ESC_USER_RAM_BYTE19_CIA_SHIFT (2U)
#define ESC_USER_RAM_BYTE19_CIA_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE19_CIA_SHIFT) & ESC_USER_RAM_BYTE19_CIA_MASK)
#define ESC_USER_RAM_BYTE19_CIA_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE19_CIA_MASK) >> ESC_USER_RAM_BYTE19_CIA_SHIFT)

/*
 * IPARO (RW)
 *
 * Individual PHY address read out (0x0510[7:3])
 */
#define ESC_USER_RAM_BYTE19_IPARO_MASK (0x2U)
#define ESC_USER_RAM_BYTE19_IPARO_SHIFT (1U)
#define ESC_USER_RAM_BYTE19_IPARO_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE19_IPARO_SHIFT) & ESC_USER_RAM_BYTE19_IPARO_MASK)
#define ESC_USER_RAM_BYTE19_IPARO_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE19_IPARO_MASK) >> ESC_USER_RAM_BYTE19_IPARO_SHIFT)

/*
 * RGMII (RW)
 *
 * RGMII
 */
#define ESC_USER_RAM_BYTE19_RGMII_MASK (0x1U)
#define ESC_USER_RAM_BYTE19_RGMII_SHIFT (0U)
#define ESC_USER_RAM_BYTE19_RGMII_SET(x) (((uint8_t)(x) << ESC_USER_RAM_BYTE19_RGMII_SHIFT) & ESC_USER_RAM_BYTE19_RGMII_MASK)
#define ESC_USER_RAM_BYTE19_RGMII_GET(x) (((uint8_t)(x) & ESC_USER_RAM_BYTE19_RGMII_MASK) >> ESC_USER_RAM_BYTE19_RGMII_SHIFT)

/* Bitfield definition for register: PDRAM */
/*
 * DATA (RW)
 *
 * Input Data
 */
#define ESC_PDRAM_DATA_MASK (0xFFFFFFFFUL)
#define ESC_PDRAM_DATA_SHIFT (0U)
#define ESC_PDRAM_DATA_SET(x) (((uint32_t)(x) << ESC_PDRAM_DATA_SHIFT) & ESC_PDRAM_DATA_MASK)
#define ESC_PDRAM_DATA_GET(x) (((uint32_t)(x) & ESC_PDRAM_DATA_MASK) >> ESC_PDRAM_DATA_SHIFT)

/* Bitfield definition for register: PDRAM_ALS */
/*
 * DATA (RW)
 *
 */
#define ESC_PDRAM_ALS_DATA_MASK (0xFFFFFFFFUL)
#define ESC_PDRAM_ALS_DATA_SHIFT (0U)
#define ESC_PDRAM_ALS_DATA_SET(x) (((uint32_t)(x) << ESC_PDRAM_ALS_DATA_SHIFT) & ESC_PDRAM_ALS_DATA_MASK)
#define ESC_PDRAM_ALS_DATA_GET(x) (((uint32_t)(x) & ESC_PDRAM_ALS_DATA_MASK) >> ESC_PDRAM_ALS_DATA_SHIFT)

/* Bitfield definition for register: GPR_CFG0 */
/*
 * PORT2_DIS (RW)
 *
 * set to disable related port(read data 00 in core reigster Port Descriptor (0x0007)
 */
#define ESC_GPR_CFG0_PORT2_DIS_MASK (0x40000UL)
#define ESC_GPR_CFG0_PORT2_DIS_SHIFT (18U)
#define ESC_GPR_CFG0_PORT2_DIS_SET(x) (((uint32_t)(x) << ESC_GPR_CFG0_PORT2_DIS_SHIFT) & ESC_GPR_CFG0_PORT2_DIS_MASK)
#define ESC_GPR_CFG0_PORT2_DIS_GET(x) (((uint32_t)(x) & ESC_GPR_CFG0_PORT2_DIS_MASK) >> ESC_GPR_CFG0_PORT2_DIS_SHIFT)

/*
 * PORT1_DIS (RW)
 *
 * set to disable related port(read data 00 in core reigster Port Descriptor (0x0007)
 */
#define ESC_GPR_CFG0_PORT1_DIS_MASK (0x20000UL)
#define ESC_GPR_CFG0_PORT1_DIS_SHIFT (17U)
#define ESC_GPR_CFG0_PORT1_DIS_SET(x) (((uint32_t)(x) << ESC_GPR_CFG0_PORT1_DIS_SHIFT) & ESC_GPR_CFG0_PORT1_DIS_MASK)
#define ESC_GPR_CFG0_PORT1_DIS_GET(x) (((uint32_t)(x) & ESC_GPR_CFG0_PORT1_DIS_MASK) >> ESC_GPR_CFG0_PORT1_DIS_SHIFT)

/*
 * PORT0_DIS (RW)
 *
 * set to disable related port(read data 00 in core reigster Port Descriptor (0x0007)
 */
#define ESC_GPR_CFG0_PORT0_DIS_MASK (0x10000UL)
#define ESC_GPR_CFG0_PORT0_DIS_SHIFT (16U)
#define ESC_GPR_CFG0_PORT0_DIS_SET(x) (((uint32_t)(x) << ESC_GPR_CFG0_PORT0_DIS_SHIFT) & ESC_GPR_CFG0_PORT0_DIS_MASK)
#define ESC_GPR_CFG0_PORT0_DIS_GET(x) (((uint32_t)(x) & ESC_GPR_CFG0_PORT0_DIS_MASK) >> ESC_GPR_CFG0_PORT0_DIS_SHIFT)

/*
 * CLK100_EN (RW)
 *
 */
#define ESC_GPR_CFG0_CLK100_EN_MASK (0x2000U)
#define ESC_GPR_CFG0_CLK100_EN_SHIFT (13U)
#define ESC_GPR_CFG0_CLK100_EN_SET(x) (((uint32_t)(x) << ESC_GPR_CFG0_CLK100_EN_SHIFT) & ESC_GPR_CFG0_CLK100_EN_MASK)
#define ESC_GPR_CFG0_CLK100_EN_GET(x) (((uint32_t)(x) & ESC_GPR_CFG0_CLK100_EN_MASK) >> ESC_GPR_CFG0_CLK100_EN_SHIFT)

/*
 * EEPROM_EMU (RW)
 *
 * 1 is EEPROM emulation mode (default)
 */
#define ESC_GPR_CFG0_EEPROM_EMU_MASK (0x1000U)
#define ESC_GPR_CFG0_EEPROM_EMU_SHIFT (12U)
#define ESC_GPR_CFG0_EEPROM_EMU_SET(x) (((uint32_t)(x) << ESC_GPR_CFG0_EEPROM_EMU_SHIFT) & ESC_GPR_CFG0_EEPROM_EMU_MASK)
#define ESC_GPR_CFG0_EEPROM_EMU_GET(x) (((uint32_t)(x) & ESC_GPR_CFG0_EEPROM_EMU_MASK) >> ESC_GPR_CFG0_EEPROM_EMU_SHIFT)

/*
 * SYNC1_PDI_IRQEN (RW)
 *
 * set to enable SYNC1 generate PDI interrupt, also set PDI_SL_CFG.SYNC1_MAER(0x151.bit7)
 */
#define ESC_GPR_CFG0_SYNC1_PDI_IRQEN_MASK (0x20U)
#define ESC_GPR_CFG0_SYNC1_PDI_IRQEN_SHIFT (5U)
#define ESC_GPR_CFG0_SYNC1_PDI_IRQEN_SET(x) (((uint32_t)(x) << ESC_GPR_CFG0_SYNC1_PDI_IRQEN_SHIFT) & ESC_GPR_CFG0_SYNC1_PDI_IRQEN_MASK)
#define ESC_GPR_CFG0_SYNC1_PDI_IRQEN_GET(x) (((uint32_t)(x) & ESC_GPR_CFG0_SYNC1_PDI_IRQEN_MASK) >> ESC_GPR_CFG0_SYNC1_PDI_IRQEN_SHIFT)

