hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_esc_regs.h
/*
 * SYNC0_PDI_IRQEN (RW)
 *
 * set to enable SYNC0 generate PDI interrupt, also set PDI_SL_CFG.SYNC1_MAER(0x151.bit3)
 */
#define ESC_GPR_CFG0_SYNC0_PDI_IRQEN_MASK (0x10U)
#define ESC_GPR_CFG0_SYNC0_PDI_IRQEN_SHIFT (4U)
#define ESC_GPR_CFG0_SYNC0_PDI_IRQEN_SET(x) (((uint32_t)(x) << ESC_GPR_CFG0_SYNC0_PDI_IRQEN_SHIFT) & ESC_GPR_CFG0_SYNC0_PDI_IRQEN_MASK)
#define ESC_GPR_CFG0_SYNC0_PDI_IRQEN_GET(x) (((uint32_t)(x) & ESC_GPR_CFG0_SYNC0_PDI_IRQEN_MASK) >> ESC_GPR_CFG0_SYNC0_PDI_IRQEN_SHIFT)

/*
 * I2C_SCLK_EN (RW)
 *
 */
#define ESC_GPR_CFG0_I2C_SCLK_EN_MASK (0x8U)
#define ESC_GPR_CFG0_I2C_SCLK_EN_SHIFT (3U)
#define ESC_GPR_CFG0_I2C_SCLK_EN_SET(x) (((uint32_t)(x) << ESC_GPR_CFG0_I2C_SCLK_EN_SHIFT) & ESC_GPR_CFG0_I2C_SCLK_EN_MASK)
#define ESC_GPR_CFG0_I2C_SCLK_EN_GET(x) (((uint32_t)(x) & ESC_GPR_CFG0_I2C_SCLK_EN_MASK) >> ESC_GPR_CFG0_I2C_SCLK_EN_SHIFT)

/*
 * PROM_SIZE (RW)
 *
 * Sets EEPROM size:
 * 0:up to 16 kbit EEPROM
 * 1:32 kbit-4Mbit EEPROM
 */
#define ESC_GPR_CFG0_PROM_SIZE_MASK (0x1U)
#define ESC_GPR_CFG0_PROM_SIZE_SHIFT (0U)
#define ESC_GPR_CFG0_PROM_SIZE_SET(x) (((uint32_t)(x) << ESC_GPR_CFG0_PROM_SIZE_SHIFT) & ESC_GPR_CFG0_PROM_SIZE_MASK)
#define ESC_GPR_CFG0_PROM_SIZE_GET(x) (((uint32_t)(x) & ESC_GPR_CFG0_PROM_SIZE_MASK) >> ESC_GPR_CFG0_PROM_SIZE_SHIFT)

/* Bitfield definition for register: GPR_CFG1 */
/*
 * SYNC1_IRQ_EN (RW)
 *
 */
#define ESC_GPR_CFG1_SYNC1_IRQ_EN_MASK (0x80000000UL)
#define ESC_GPR_CFG1_SYNC1_IRQ_EN_SHIFT (31U)
#define ESC_GPR_CFG1_SYNC1_IRQ_EN_SET(x) (((uint32_t)(x) << ESC_GPR_CFG1_SYNC1_IRQ_EN_SHIFT) & ESC_GPR_CFG1_SYNC1_IRQ_EN_MASK)
#define ESC_GPR_CFG1_SYNC1_IRQ_EN_GET(x) (((uint32_t)(x) & ESC_GPR_CFG1_SYNC1_IRQ_EN_MASK) >> ESC_GPR_CFG1_SYNC1_IRQ_EN_SHIFT)

/*
 * SYNC0_IRQ_EN (RW)
 *
 */
#define ESC_GPR_CFG1_SYNC0_IRQ_EN_MASK (0x40000000UL)
#define ESC_GPR_CFG1_SYNC0_IRQ_EN_SHIFT (30U)
#define ESC_GPR_CFG1_SYNC0_IRQ_EN_SET(x) (((uint32_t)(x) << ESC_GPR_CFG1_SYNC0_IRQ_EN_SHIFT) & ESC_GPR_CFG1_SYNC0_IRQ_EN_MASK)
#define ESC_GPR_CFG1_SYNC0_IRQ_EN_GET(x) (((uint32_t)(x) & ESC_GPR_CFG1_SYNC0_IRQ_EN_MASK) >> ESC_GPR_CFG1_SYNC0_IRQ_EN_SHIFT)

/*
 * RSTO_IRQ_EN (RW)
 *
 */
#define ESC_GPR_CFG1_RSTO_IRQ_EN_MASK (0x20000000UL)
#define ESC_GPR_CFG1_RSTO_IRQ_EN_SHIFT (29U)
#define ESC_GPR_CFG1_RSTO_IRQ_EN_SET(x) (((uint32_t)(x) << ESC_GPR_CFG1_RSTO_IRQ_EN_SHIFT) & ESC_GPR_CFG1_RSTO_IRQ_EN_MASK)
#define ESC_GPR_CFG1_RSTO_IRQ_EN_GET(x) (((uint32_t)(x) & ESC_GPR_CFG1_RSTO_IRQ_EN_MASK) >> ESC_GPR_CFG1_RSTO_IRQ_EN_SHIFT)

/*
 * SYNC1_DMA_EN (RW)
 *
 */
#define ESC_GPR_CFG1_SYNC1_DMA_EN_MASK (0x2000U)
#define ESC_GPR_CFG1_SYNC1_DMA_EN_SHIFT (13U)
#define ESC_GPR_CFG1_SYNC1_DMA_EN_SET(x) (((uint32_t)(x) << ESC_GPR_CFG1_SYNC1_DMA_EN_SHIFT) & ESC_GPR_CFG1_SYNC1_DMA_EN_MASK)
#define ESC_GPR_CFG1_SYNC1_DMA_EN_GET(x) (((uint32_t)(x) & ESC_GPR_CFG1_SYNC1_DMA_EN_MASK) >> ESC_GPR_CFG1_SYNC1_DMA_EN_SHIFT)

/*
 * SYNC0_DMA_EN (RW)
 *
 */
#define ESC_GPR_CFG1_SYNC0_DMA_EN_MASK (0x1000U)
#define ESC_GPR_CFG1_SYNC0_DMA_EN_SHIFT (12U)
#define ESC_GPR_CFG1_SYNC0_DMA_EN_SET(x) (((uint32_t)(x) << ESC_GPR_CFG1_SYNC0_DMA_EN_SHIFT) & ESC_GPR_CFG1_SYNC0_DMA_EN_MASK)
#define ESC_GPR_CFG1_SYNC0_DMA_EN_GET(x) (((uint32_t)(x) & ESC_GPR_CFG1_SYNC0_DMA_EN_MASK) >> ESC_GPR_CFG1_SYNC0_DMA_EN_SHIFT)

/*
 * LATCH1_FROM_IO (RW)
 *
 * 0:from NTM
 */
#define ESC_GPR_CFG1_LATCH1_FROM_IO_MASK (0x200U)
#define ESC_GPR_CFG1_LATCH1_FROM_IO_SHIFT (9U)
#define ESC_GPR_CFG1_LATCH1_FROM_IO_SET(x) (((uint32_t)(x) << ESC_GPR_CFG1_LATCH1_FROM_IO_SHIFT) & ESC_GPR_CFG1_LATCH1_FROM_IO_MASK)
#define ESC_GPR_CFG1_LATCH1_FROM_IO_GET(x) (((uint32_t)(x) & ESC_GPR_CFG1_LATCH1_FROM_IO_MASK) >> ESC_GPR_CFG1_LATCH1_FROM_IO_SHIFT)

/*
 * LATCH0_FROM_IO (RW)
 *
 * 0:from TRIGGER_MUX
 */
#define ESC_GPR_CFG1_LATCH0_FROM_IO_MASK (0x100U)
#define ESC_GPR_CFG1_LATCH0_FROM_IO_SHIFT (8U)
#define ESC_GPR_CFG1_LATCH0_FROM_IO_SET(x) (((uint32_t)(x) << ESC_GPR_CFG1_LATCH0_FROM_IO_SHIFT) & ESC_GPR_CFG1_LATCH0_FROM_IO_MASK)
#define ESC_GPR_CFG1_LATCH0_FROM_IO_GET(x) (((uint32_t)(x) & ESC_GPR_CFG1_LATCH0_FROM_IO_MASK) >> ESC_GPR_CFG1_LATCH0_FROM_IO_SHIFT)

/*
 * RSTO_OVRD (RW)
 *
 */
#define ESC_GPR_CFG1_RSTO_OVRD_MASK (0x80U)
#define ESC_GPR_CFG1_RSTO_OVRD_SHIFT (7U)
#define ESC_GPR_CFG1_RSTO_OVRD_SET(x) (((uint32_t)(x) << ESC_GPR_CFG1_RSTO_OVRD_SHIFT) & ESC_GPR_CFG1_RSTO_OVRD_MASK)
#define ESC_GPR_CFG1_RSTO_OVRD_GET(x) (((uint32_t)(x) & ESC_GPR_CFG1_RSTO_OVRD_MASK) >> ESC_GPR_CFG1_RSTO_OVRD_SHIFT)

/*
 * RSTO_OVRD_ENJ (RW)
 *
 */
#define ESC_GPR_CFG1_RSTO_OVRD_ENJ_MASK (0x40U)
#define ESC_GPR_CFG1_RSTO_OVRD_ENJ_SHIFT (6U)
#define ESC_GPR_CFG1_RSTO_OVRD_ENJ_SET(x) (((uint32_t)(x) << ESC_GPR_CFG1_RSTO_OVRD_ENJ_SHIFT) & ESC_GPR_CFG1_RSTO_OVRD_ENJ_MASK)
#define ESC_GPR_CFG1_RSTO_OVRD_ENJ_GET(x) (((uint32_t)(x) & ESC_GPR_CFG1_RSTO_OVRD_ENJ_MASK) >> ESC_GPR_CFG1_RSTO_OVRD_ENJ_SHIFT)

/* Bitfield definition for register: GPR_CFG2 */
/*
 * NMII_LINK2_FROM_IO (RW)
 *
 */
#define ESC_GPR_CFG2_NMII_LINK2_FROM_IO_MASK (0x20000000UL)
#define ESC_GPR_CFG2_NMII_LINK2_FROM_IO_SHIFT (29U)
#define ESC_GPR_CFG2_NMII_LINK2_FROM_IO_SET(x) (((uint32_t)(x) << ESC_GPR_CFG2_NMII_LINK2_FROM_IO_SHIFT) & ESC_GPR_CFG2_NMII_LINK2_FROM_IO_MASK)
#define ESC_GPR_CFG2_NMII_LINK2_FROM_IO_GET(x) (((uint32_t)(x) & ESC_GPR_CFG2_NMII_LINK2_FROM_IO_MASK) >> ESC_GPR_CFG2_NMII_LINK2_FROM_IO_SHIFT)

/*
 * NMII_LINK2_GPR (RW)
 *
 */
#define ESC_GPR_CFG2_NMII_LINK2_GPR_MASK (0x10000000UL)
#define ESC_GPR_CFG2_NMII_LINK2_GPR_SHIFT (28U)
#define ESC_GPR_CFG2_NMII_LINK2_GPR_SET(x) (((uint32_t)(x) << ESC_GPR_CFG2_NMII_LINK2_GPR_SHIFT) & ESC_GPR_CFG2_NMII_LINK2_GPR_MASK)
#define ESC_GPR_CFG2_NMII_LINK2_GPR_GET(x) (((uint32_t)(x) & ESC_GPR_CFG2_NMII_LINK2_GPR_MASK) >> ESC_GPR_CFG2_NMII_LINK2_GPR_SHIFT)

/*
 * NMII_LINK1_FROM_IO (RW)
 *
 */
#define ESC_GPR_CFG2_NMII_LINK1_FROM_IO_MASK (0x2000000UL)
#define ESC_GPR_CFG2_NMII_LINK1_FROM_IO_SHIFT (25U)
#define ESC_GPR_CFG2_NMII_LINK1_FROM_IO_SET(x) (((uint32_t)(x) << ESC_GPR_CFG2_NMII_LINK1_FROM_IO_SHIFT) & ESC_GPR_CFG2_NMII_LINK1_FROM_IO_MASK)
#define ESC_GPR_CFG2_NMII_LINK1_FROM_IO_GET(x) (((uint32_t)(x) & ESC_GPR_CFG2_NMII_LINK1_FROM_IO_MASK) >> ESC_GPR_CFG2_NMII_LINK1_FROM_IO_SHIFT)

