hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_esc_regs.h
/*
 * RMII_P1_RXCK_REFCLK_OE (RW)
 *
 */
#define ESC_PHY_CFG1_RMII_P1_RXCK_REFCLK_OE_MASK (0x2U)
#define ESC_PHY_CFG1_RMII_P1_RXCK_REFCLK_OE_SHIFT (1U)
#define ESC_PHY_CFG1_RMII_P1_RXCK_REFCLK_OE_SET(x) (((uint32_t)(x) << ESC_PHY_CFG1_RMII_P1_RXCK_REFCLK_OE_SHIFT) & ESC_PHY_CFG1_RMII_P1_RXCK_REFCLK_OE_MASK)
#define ESC_PHY_CFG1_RMII_P1_RXCK_REFCLK_OE_GET(x) (((uint32_t)(x) & ESC_PHY_CFG1_RMII_P1_RXCK_REFCLK_OE_MASK) >> ESC_PHY_CFG1_RMII_P1_RXCK_REFCLK_OE_SHIFT)

/*
 * RMII_P0_RXCK_REFCLK_OE (RW)
 *
 */
#define ESC_PHY_CFG1_RMII_P0_RXCK_REFCLK_OE_MASK (0x1U)
#define ESC_PHY_CFG1_RMII_P0_RXCK_REFCLK_OE_SHIFT (0U)
#define ESC_PHY_CFG1_RMII_P0_RXCK_REFCLK_OE_SET(x) (((uint32_t)(x) << ESC_PHY_CFG1_RMII_P0_RXCK_REFCLK_OE_SHIFT) & ESC_PHY_CFG1_RMII_P0_RXCK_REFCLK_OE_MASK)
#define ESC_PHY_CFG1_RMII_P0_RXCK_REFCLK_OE_GET(x) (((uint32_t)(x) & ESC_PHY_CFG1_RMII_P0_RXCK_REFCLK_OE_MASK) >> ESC_PHY_CFG1_RMII_P0_RXCK_REFCLK_OE_SHIFT)

/* Bitfield definition for register: GPIO_CTRL */
/*
 * SW_LATCH_GPI (WO)
 *
 * if gpi_trig_sel is set to 4'b1001, setting this bit will latch GPI to gpi_reg0/1
 */
#define ESC_GPIO_CTRL_SW_LATCH_GPI_MASK (0x80000000UL)
#define ESC_GPIO_CTRL_SW_LATCH_GPI_SHIFT (31U)
#define ESC_GPIO_CTRL_SW_LATCH_GPI_SET(x) (((uint32_t)(x) << ESC_GPIO_CTRL_SW_LATCH_GPI_SHIFT) & ESC_GPIO_CTRL_SW_LATCH_GPI_MASK)
#define ESC_GPIO_CTRL_SW_LATCH_GPI_GET(x) (((uint32_t)(x) & ESC_GPIO_CTRL_SW_LATCH_GPI_MASK) >> ESC_GPIO_CTRL_SW_LATCH_GPI_SHIFT)

/*
 * SW_LATCH_GPO (WO)
 *
 * if gpo_trig_sel is set to 4'b1001, setting this bit will latch GPO to gpo_reg0/1
 */
#define ESC_GPIO_CTRL_SW_LATCH_GPO_MASK (0x40000000UL)
#define ESC_GPIO_CTRL_SW_LATCH_GPO_SHIFT (30U)
#define ESC_GPIO_CTRL_SW_LATCH_GPO_SET(x) (((uint32_t)(x) << ESC_GPIO_CTRL_SW_LATCH_GPO_SHIFT) & ESC_GPIO_CTRL_SW_LATCH_GPO_MASK)
#define ESC_GPIO_CTRL_SW_LATCH_GPO_GET(x) (((uint32_t)(x) & ESC_GPIO_CTRL_SW_LATCH_GPO_MASK) >> ESC_GPIO_CTRL_SW_LATCH_GPO_SHIFT)

/*
 * GPI_OVERRIDE_EN (RW)
 *
 * set this bit will use GPI from the software register gpi_override0/1
 * clr to use GPI from pad directly
 */
#define ESC_GPIO_CTRL_GPI_OVERRIDE_EN_MASK (0x2000U)
#define ESC_GPIO_CTRL_GPI_OVERRIDE_EN_SHIFT (13U)
#define ESC_GPIO_CTRL_GPI_OVERRIDE_EN_SET(x) (((uint32_t)(x) << ESC_GPIO_CTRL_GPI_OVERRIDE_EN_SHIFT) & ESC_GPIO_CTRL_GPI_OVERRIDE_EN_MASK)
#define ESC_GPIO_CTRL_GPI_OVERRIDE_EN_GET(x) (((uint32_t)(x) & ESC_GPIO_CTRL_GPI_OVERRIDE_EN_MASK) >> ESC_GPIO_CTRL_GPI_OVERRIDE_EN_SHIFT)

/*
 * GPI_TRIG_EN (RW)
 *
 * use gpi_trig_sel can select the trigger event to latch GPI signal(from reg or pad)
 * set to use triggered signal;
 * clr to use signals direclty(from reg or pad)
 * assign pdi_gpi = gpi_trig_en ? gpi_reg :
 *                (gpi_override_en ? gpi_override :pad_di_ecat_gpi);
 */
#define ESC_GPIO_CTRL_GPI_TRIG_EN_MASK (0x1000U)
#define ESC_GPIO_CTRL_GPI_TRIG_EN_SHIFT (12U)
#define ESC_GPIO_CTRL_GPI_TRIG_EN_SET(x) (((uint32_t)(x) << ESC_GPIO_CTRL_GPI_TRIG_EN_SHIFT) & ESC_GPIO_CTRL_GPI_TRIG_EN_MASK)
#define ESC_GPIO_CTRL_GPI_TRIG_EN_GET(x) (((uint32_t)(x) & ESC_GPIO_CTRL_GPI_TRIG_EN_MASK) >> ESC_GPIO_CTRL_GPI_TRIG_EN_SHIFT)

/*
 * GPI_TRIG_SEL (RW)
 *
 * select the trigger signal to latch GPI.
 * 0000: SOF;  0001: EOF;  0010: pos of  SYNC0;  0011: pos of SYNC1;
 * 0100: pos of LATCH0;   0101: pos of LATCH1;   0110: neg of LATCH0;   0111: neg of LATCH1
 * 1000: wdog trigger;   1001: sw set gpio_ctrl[31];   1110: use gpi_trg_cfg for separate byte control
 * others no trigger
 */
#define ESC_GPIO_CTRL_GPI_TRIG_SEL_MASK (0xF00U)
#define ESC_GPIO_CTRL_GPI_TRIG_SEL_SHIFT (8U)
#define ESC_GPIO_CTRL_GPI_TRIG_SEL_SET(x) (((uint32_t)(x) << ESC_GPIO_CTRL_GPI_TRIG_SEL_SHIFT) & ESC_GPIO_CTRL_GPI_TRIG_SEL_MASK)
#define ESC_GPIO_CTRL_GPI_TRIG_SEL_GET(x) (((uint32_t)(x) & ESC_GPIO_CTRL_GPI_TRIG_SEL_MASK) >> ESC_GPIO_CTRL_GPI_TRIG_SEL_SHIFT)

/*
 * GPO_TRIG_EN (RW)
 *
 * use gpo_trig_sel can select the trigger event to latch GPO signal(from core)
 * set to use triggered signal;
 * clr to use GPO signals direclty(from reg or pad)
 */
#define ESC_GPIO_CTRL_GPO_TRIG_EN_MASK (0x10U)
#define ESC_GPIO_CTRL_GPO_TRIG_EN_SHIFT (4U)
#define ESC_GPIO_CTRL_GPO_TRIG_EN_SET(x) (((uint32_t)(x) << ESC_GPIO_CTRL_GPO_TRIG_EN_SHIFT) & ESC_GPIO_CTRL_GPO_TRIG_EN_MASK)
#define ESC_GPIO_CTRL_GPO_TRIG_EN_GET(x) (((uint32_t)(x) & ESC_GPIO_CTRL_GPO_TRIG_EN_MASK) >> ESC_GPIO_CTRL_GPO_TRIG_EN_SHIFT)

/*
 * GPO_TRIG_SEL (RW)
 *
 * select the trigger signal to latch GPO.
 * 0000: SOF;  0001: EOF;  0010: pos of  SYNC0;  0011: pos of SYNC1;
 * 0100: pos of LATCH0;   0101: pos of LATCH1;   0110: neg of LATCH0;   0111: neg of LATCH1
 * 1000: wdog trigger;   1001: sw set gpio_ctrl[30];     1110: use gpo_trg_cfg for separate byte control
 * others no trigger
 */
#define ESC_GPIO_CTRL_GPO_TRIG_SEL_MASK (0xFU)
#define ESC_GPIO_CTRL_GPO_TRIG_SEL_SHIFT (0U)
#define ESC_GPIO_CTRL_GPO_TRIG_SEL_SET(x) (((uint32_t)(x) << ESC_GPIO_CTRL_GPO_TRIG_SEL_SHIFT) & ESC_GPIO_CTRL_GPO_TRIG_SEL_MASK)
#define ESC_GPIO_CTRL_GPO_TRIG_SEL_GET(x) (((uint32_t)(x) & ESC_GPIO_CTRL_GPO_TRIG_SEL_MASK) >> ESC_GPIO_CTRL_GPO_TRIG_SEL_SHIFT)

/* Bitfield definition for register: GPI_TRIG_CFG */
/*
 * GPI_TRIG_CFG (RW)
 *
 * separage GPI trigger control for latch GPI, 0000~1001 are same as gpi_trig_sel, just 4bit for one byte.
 * Bit3:0 to control GPI[7:0],   bit7:4 to control GPI[15:8]…    bit31:28 to control GPI[63:56]
 */
#define ESC_GPI_TRIG_CFG_GPI_TRIG_CFG_MASK (0xFFFFFFFFUL)
#define ESC_GPI_TRIG_CFG_GPI_TRIG_CFG_SHIFT (0U)
#define ESC_GPI_TRIG_CFG_GPI_TRIG_CFG_SET(x) (((uint32_t)(x) << ESC_GPI_TRIG_CFG_GPI_TRIG_CFG_SHIFT) & ESC_GPI_TRIG_CFG_GPI_TRIG_CFG_MASK)
#define ESC_GPI_TRIG_CFG_GPI_TRIG_CFG_GET(x) (((uint32_t)(x) & ESC_GPI_TRIG_CFG_GPI_TRIG_CFG_MASK) >> ESC_GPI_TRIG_CFG_GPI_TRIG_CFG_SHIFT)

/* Bitfield definition for register: GPO_TRIG_CFG */
/*
 * GPO_TRIG_CFG (RW)
 *
 * separage GPO trigger control for latch GPO, 0000~1001 are same as gpo_trig_sel, just 4bit for one byte.
 * Bit3:0 to control GPO[7:0],   bit7:4 to control GPO[15:8]…    bit31:28 to control GPO[63:56]
 */
#define ESC_GPO_TRIG_CFG_GPO_TRIG_CFG_MASK (0xFFFFFFFFUL)
#define ESC_GPO_TRIG_CFG_GPO_TRIG_CFG_SHIFT (0U)
#define ESC_GPO_TRIG_CFG_GPO_TRIG_CFG_SET(x) (((uint32_t)(x) << ESC_GPO_TRIG_CFG_GPO_TRIG_CFG_SHIFT) & ESC_GPO_TRIG_CFG_GPO_TRIG_CFG_MASK)
#define ESC_GPO_TRIG_CFG_GPO_TRIG_CFG_GET(x) (((uint32_t)(x) & ESC_GPO_TRIG_CFG_GPO_TRIG_CFG_MASK) >> ESC_GPO_TRIG_CFG_GPO_TRIG_CFG_SHIFT)

