hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_esc_regs.h
/* Bitfield definition for register: GPI_OVERRIDE0 */
/*
 * GPR_OVERRIDE_LOW (RW)
 *
 */
#define ESC_GPI_OVERRIDE0_GPR_OVERRIDE_LOW_MASK (0xFFFFFFFFUL)
#define ESC_GPI_OVERRIDE0_GPR_OVERRIDE_LOW_SHIFT (0U)
#define ESC_GPI_OVERRIDE0_GPR_OVERRIDE_LOW_SET(x) (((uint32_t)(x) << ESC_GPI_OVERRIDE0_GPR_OVERRIDE_LOW_SHIFT) & ESC_GPI_OVERRIDE0_GPR_OVERRIDE_LOW_MASK)
#define ESC_GPI_OVERRIDE0_GPR_OVERRIDE_LOW_GET(x) (((uint32_t)(x) & ESC_GPI_OVERRIDE0_GPR_OVERRIDE_LOW_MASK) >> ESC_GPI_OVERRIDE0_GPR_OVERRIDE_LOW_SHIFT)

/* Bitfield definition for register: GPI_OVERRIDE1 */
/*
 * GPR_OVERRIDE_HIGH (RW)
 *
 */
#define ESC_GPI_OVERRIDE1_GPR_OVERRIDE_HIGH_MASK (0xFFFFFFFFUL)
#define ESC_GPI_OVERRIDE1_GPR_OVERRIDE_HIGH_SHIFT (0U)
#define ESC_GPI_OVERRIDE1_GPR_OVERRIDE_HIGH_SET(x) (((uint32_t)(x) << ESC_GPI_OVERRIDE1_GPR_OVERRIDE_HIGH_SHIFT) & ESC_GPI_OVERRIDE1_GPR_OVERRIDE_HIGH_MASK)
#define ESC_GPI_OVERRIDE1_GPR_OVERRIDE_HIGH_GET(x) (((uint32_t)(x) & ESC_GPI_OVERRIDE1_GPR_OVERRIDE_HIGH_MASK) >> ESC_GPI_OVERRIDE1_GPR_OVERRIDE_HIGH_SHIFT)

/* Bitfield definition for register: GPO_REG0 */
/*
 * VALUE (RO)
 *
 */
#define ESC_GPO_REG0_VALUE_MASK (0xFFFFFFFFUL)
#define ESC_GPO_REG0_VALUE_SHIFT (0U)
#define ESC_GPO_REG0_VALUE_GET(x) (((uint32_t)(x) & ESC_GPO_REG0_VALUE_MASK) >> ESC_GPO_REG0_VALUE_SHIFT)

/* Bitfield definition for register: GPO_REG1 */
/*
 * VALUE (RO)
 *
 */
#define ESC_GPO_REG1_VALUE_MASK (0xFFFFFFFFUL)
#define ESC_GPO_REG1_VALUE_SHIFT (0U)
#define ESC_GPO_REG1_VALUE_GET(x) (((uint32_t)(x) & ESC_GPO_REG1_VALUE_MASK) >> ESC_GPO_REG1_VALUE_SHIFT)

/* Bitfield definition for register: GPI_REG0 */
/*
 * VALUE (RO)
 *
 */
#define ESC_GPI_REG0_VALUE_MASK (0xFFFFFFFFUL)
#define ESC_GPI_REG0_VALUE_SHIFT (0U)
#define ESC_GPI_REG0_VALUE_GET(x) (((uint32_t)(x) & ESC_GPI_REG0_VALUE_MASK) >> ESC_GPI_REG0_VALUE_SHIFT)

/* Bitfield definition for register: GPI_REG1 */
/*
 * VALUE (RO)
 *
 */
#define ESC_GPI_REG1_VALUE_MASK (0xFFFFFFFFUL)
#define ESC_GPI_REG1_VALUE_SHIFT (0U)
#define ESC_GPI_REG1_VALUE_GET(x) (((uint32_t)(x) & ESC_GPI_REG1_VALUE_MASK) >> ESC_GPI_REG1_VALUE_SHIFT)

/* Bitfield definition for register: GPR_STATUS */
/*
 * NLINK2_PADSEL (RO)
 *
 */
#define ESC_GPR_STATUS_NLINK2_PADSEL_MASK (0xF0000000UL)
#define ESC_GPR_STATUS_NLINK2_PADSEL_SHIFT (28U)
#define ESC_GPR_STATUS_NLINK2_PADSEL_GET(x) (((uint32_t)(x) & ESC_GPR_STATUS_NLINK2_PADSEL_MASK) >> ESC_GPR_STATUS_NLINK2_PADSEL_SHIFT)

/*
 * NLINK1_PADSEL (RO)
 *
 */
#define ESC_GPR_STATUS_NLINK1_PADSEL_MASK (0xF000000UL)
#define ESC_GPR_STATUS_NLINK1_PADSEL_SHIFT (24U)
#define ESC_GPR_STATUS_NLINK1_PADSEL_GET(x) (((uint32_t)(x) & ESC_GPR_STATUS_NLINK1_PADSEL_MASK) >> ESC_GPR_STATUS_NLINK1_PADSEL_SHIFT)

/*
 * NLINK0_PADSEL (RO)
 *
 */
#define ESC_GPR_STATUS_NLINK0_PADSEL_MASK (0xF00000UL)
#define ESC_GPR_STATUS_NLINK0_PADSEL_SHIFT (20U)
#define ESC_GPR_STATUS_NLINK0_PADSEL_GET(x) (((uint32_t)(x) & ESC_GPR_STATUS_NLINK0_PADSEL_MASK) >> ESC_GPR_STATUS_NLINK0_PADSEL_SHIFT)

/*
 * PDI_SOF (RO)
 *
 */
#define ESC_GPR_STATUS_PDI_SOF_MASK (0x80000UL)
#define ESC_GPR_STATUS_PDI_SOF_SHIFT (19U)
#define ESC_GPR_STATUS_PDI_SOF_GET(x) (((uint32_t)(x) & ESC_GPR_STATUS_PDI_SOF_MASK) >> ESC_GPR_STATUS_PDI_SOF_SHIFT)

/*
 * PDI_EOF (RO)
 *
 */
#define ESC_GPR_STATUS_PDI_EOF_MASK (0x40000UL)
#define ESC_GPR_STATUS_PDI_EOF_SHIFT (18U)
#define ESC_GPR_STATUS_PDI_EOF_GET(x) (((uint32_t)(x) & ESC_GPR_STATUS_PDI_EOF_MASK) >> ESC_GPR_STATUS_PDI_EOF_SHIFT)

/*
 * PDI_WD_TRIGGER (RO)
 *
 */
#define ESC_GPR_STATUS_PDI_WD_TRIGGER_MASK (0x20000UL)
#define ESC_GPR_STATUS_PDI_WD_TRIGGER_SHIFT (17U)
#define ESC_GPR_STATUS_PDI_WD_TRIGGER_GET(x) (((uint32_t)(x) & ESC_GPR_STATUS_PDI_WD_TRIGGER_MASK) >> ESC_GPR_STATUS_PDI_WD_TRIGGER_SHIFT)

/*
 * PDI_WD_STATE (RO)
 *
 */
#define ESC_GPR_STATUS_PDI_WD_STATE_MASK (0x10000UL)
#define ESC_GPR_STATUS_PDI_WD_STATE_SHIFT (16U)
#define ESC_GPR_STATUS_PDI_WD_STATE_GET(x) (((uint32_t)(x) & ESC_GPR_STATUS_PDI_WD_STATE_MASK) >> ESC_GPR_STATUS_PDI_WD_STATE_SHIFT)

/*
 * SYNC_OUT1 (RO)
 *
 */
#define ESC_GPR_STATUS_SYNC_OUT1_MASK (0x200U)
#define ESC_GPR_STATUS_SYNC_OUT1_SHIFT (9U)
#define ESC_GPR_STATUS_SYNC_OUT1_GET(x) (((uint32_t)(x) & ESC_GPR_STATUS_SYNC_OUT1_MASK) >> ESC_GPR_STATUS_SYNC_OUT1_SHIFT)

/*
 * SYNC_OUT0 (RO)
 *
 */
#define ESC_GPR_STATUS_SYNC_OUT0_MASK (0x100U)
#define ESC_GPR_STATUS_SYNC_OUT0_SHIFT (8U)
#define ESC_GPR_STATUS_SYNC_OUT0_GET(x) (((uint32_t)(x) & ESC_GPR_STATUS_SYNC_OUT0_MASK) >> ESC_GPR_STATUS_SYNC_OUT0_SHIFT)

/*
 * LED_STATE_RUN (RO)
 *
 */
#define ESC_GPR_STATUS_LED_STATE_RUN_MASK (0x40U)
#define ESC_GPR_STATUS_LED_STATE_RUN_SHIFT (6U)
#define ESC_GPR_STATUS_LED_STATE_RUN_GET(x) (((uint32_t)(x) & ESC_GPR_STATUS_LED_STATE_RUN_MASK) >> ESC_GPR_STATUS_LED_STATE_RUN_SHIFT)

/*
 * LED_ERR (RO)
 *
 */
#define ESC_GPR_STATUS_LED_ERR_MASK (0x20U)
#define ESC_GPR_STATUS_LED_ERR_SHIFT (5U)
#define ESC_GPR_STATUS_LED_ERR_GET(x) (((uint32_t)(x) & ESC_GPR_STATUS_LED_ERR_MASK) >> ESC_GPR_STATUS_LED_ERR_SHIFT)

/*
 * LED_RUN (RO)
 *
 */
#define ESC_GPR_STATUS_LED_RUN_MASK (0x10U)
#define ESC_GPR_STATUS_LED_RUN_SHIFT (4U)
#define ESC_GPR_STATUS_LED_RUN_GET(x) (((uint32_t)(x) & ESC_GPR_STATUS_LED_RUN_MASK) >> ESC_GPR_STATUS_LED_RUN_SHIFT)

/*
 * DEV_STATE (RO)
 *
 */
#define ESC_GPR_STATUS_DEV_STATE_MASK (0x8U)
#define ESC_GPR_STATUS_DEV_STATE_SHIFT (3U)
#define ESC_GPR_STATUS_DEV_STATE_GET(x) (((uint32_t)(x) & ESC_GPR_STATUS_DEV_STATE_MASK) >> ESC_GPR_STATUS_DEV_STATE_SHIFT)

/*
 * LINK_ACT (RO)
 *
 */
#define ESC_GPR_STATUS_LINK_ACT_MASK (0x7U)
#define ESC_GPR_STATUS_LINK_ACT_SHIFT (0U)
#define ESC_GPR_STATUS_LINK_ACT_GET(x) (((uint32_t)(x) & ESC_GPR_STATUS_LINK_ACT_MASK) >> ESC_GPR_STATUS_LINK_ACT_SHIFT)

/* Bitfield definition for register array: IO_CFG */
/*
 * INVERT (RW)
 *
 * 1:invert the IO
 */
#define ESC_IO_CFG_INVERT_MASK (0x10U)
#define ESC_IO_CFG_INVERT_SHIFT (4U)
#define ESC_IO_CFG_INVERT_SET(x) (((uint32_t)(x) << ESC_IO_CFG_INVERT_SHIFT) & ESC_IO_CFG_INVERT_MASK)
#define ESC_IO_CFG_INVERT_GET(x) (((uint32_t)(x) & ESC_IO_CFG_INVERT_MASK) >> ESC_IO_CFG_INVERT_SHIFT)

