hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_esc_regs.h
/*
 * FUNC_ALT (RW)
 *
 * IO usage:
 * 0:NMII_LINK0
 * 1:NMII_LINK1
 * 2:NMII_LINK2
 * 3:LINK_ACT0
 * 4:LINK_ACT1
 * 5:LINK_ACT2
 * 6:LED_RUN
 * 7:LED_ERR
 * 8:RESET_OUT
 */
#define ESC_IO_CFG_FUNC_ALT_MASK (0xFU)
#define ESC_IO_CFG_FUNC_ALT_SHIFT (0U)
#define ESC_IO_CFG_FUNC_ALT_SET(x) (((uint32_t)(x) << ESC_IO_CFG_FUNC_ALT_SHIFT) & ESC_IO_CFG_FUNC_ALT_MASK)
#define ESC_IO_CFG_FUNC_ALT_GET(x) (((uint32_t)(x) & ESC_IO_CFG_FUNC_ALT_MASK) >> ESC_IO_CFG_FUNC_ALT_SHIFT)



/* RX_ERR_CNT register group index macro definition */
#define ESC_RX_ERR_CNT_PORT0 (0UL)
#define ESC_RX_ERR_CNT_PORT1 (1UL)
#define ESC_RX_ERR_CNT_PORT2 (2UL)
#define ESC_RX_ERR_CNT_PORT3 (3UL)

/* FWD_RX_ERR_CNT register group index macro definition */
#define ESC_FWD_RX_ERR_CNT_PORT0 (0UL)
#define ESC_FWD_RX_ERR_CNT_PORT1 (1UL)
#define ESC_FWD_RX_ERR_CNT_PORT2 (2UL)
#define ESC_FWD_RX_ERR_CNT_PORT3 (3UL)

/* LOST_LINK_CNT register group index macro definition */
#define ESC_LOST_LINK_CNT_PORT0 (0UL)
#define ESC_LOST_LINK_CNT_PORT1 (1UL)
#define ESC_LOST_LINK_CNT_PORT2 (2UL)
#define ESC_LOST_LINK_CNT_PORT3 (3UL)

/* PHY_STAT register group index macro definition */
#define ESC_PHY_STAT_PORT0 (0UL)
#define ESC_PHY_STAT_PORT1 (1UL)
#define ESC_PHY_STAT_PORT2 (2UL)
#define ESC_PHY_STAT_PORT3 (3UL)

/* FMMU register group index macro definition */
#define ESC_FMMU_0 (0UL)
#define ESC_FMMU_1 (1UL)
#define ESC_FMMU_2 (2UL)
#define ESC_FMMU_3 (3UL)
#define ESC_FMMU_4 (4UL)
#define ESC_FMMU_5 (5UL)
#define ESC_FMMU_6 (6UL)
#define ESC_FMMU_7 (7UL)

/* SYNCM register group index macro definition */
#define ESC_SYNCM_0 (0UL)
#define ESC_SYNCM_1 (1UL)
#define ESC_SYNCM_2 (2UL)
#define ESC_SYNCM_3 (3UL)
#define ESC_SYNCM_4 (4UL)
#define ESC_SYNCM_5 (5UL)
#define ESC_SYNCM_6 (6UL)
#define ESC_SYNCM_7 (7UL)

/* RCV_TIME register group index macro definition */
#define ESC_RCV_TIME_PORT0 (0UL)
#define ESC_RCV_TIME_PORT1 (1UL)
#define ESC_RCV_TIME_PORT2 (2UL)
#define ESC_RCV_TIME_PORT3 (3UL)

/* IO_CFG register group index macro definition */
#define ESC_IO_CFG_CTR0 (0UL)
#define ESC_IO_CFG_CTR1 (1UL)
#define ESC_IO_CFG_CTR2 (2UL)
#define ESC_IO_CFG_CTR3 (3UL)
#define ESC_IO_CFG_CTR4 (4UL)
#define ESC_IO_CFG_CTR5 (5UL)
#define ESC_IO_CFG_CTR6 (6UL)
#define ESC_IO_CFG_CTR7 (7UL)
#define ESC_IO_CFG_CTR8 (8UL)


#endif /* HPM_ESC_H */
